-- ЗОНА			|ИГРОК1		|ИГРОК2
----------------------------------------
-- Cтолица		|красная	|пурпурная	|
-- Зона т1		|зелёная	|голубая	|
-- Зона т2		|синяя		|жёлтая		|
-- Зона т3		|белая		|серая		|
-- Зона-тренер	|т.зеленая	|оранжевая	|
-- Трежа		|		чёрная			|
-----------------------------------------
-- Чёрной зоны касаться: синяя, жёлтая, белая, серая, т.зеленая, оранжевая!

---------------
-- НАСТРОЙКИ
-- Версия
local ver = '3.4b'

-- режим карты (1 - для игры одним героем; 2 - для классической игры) parameters[1]

local gmode = 1

-- специальный режим карты - минизоны (1 - есть доп.зоны, 2 - есть доп.зоны и столица треьего игрока, 3 - нет доп.зон)
local smode = 2

-- коэффициент разброса силы нейтралов по умолчанию [страндарт = 1.05]
local kr = 1.05

-- коэффициент сложности (0.6-0.8 легко; 0.8-1 средне; >1 сложно) [страндарт = 0.92] parameters[3]
local kef = 0.92

-- банка на жезлы случайно
local banka = math.random(1,4) -- не использую !!!

-- эксперементальный режим ограничения бафов (0 - отключён, 1 - включён)
local smnsit = 0

-- модификация "Котовасия" (0 - выкл, 1 - вкл) [страндарт = 0] parameters[2] 
local kotovasia = 0

-- модификация "Playmobs" (0 - выкл, 1 - вкл) [страндарт = 0] parameters[2] 
local playmobs = 0

-- модификация "Точтость +10%" (0 - выкл, 1 - вкл) [страндарт = 0] parameters[2] 
local accuracy10 = 0

----------------
-- КОД ШАБЛОНА

-- переменные для ист-ков (для каждой расы)
local tbl = {1,0}

-- переменные для закла баф/дебаф минизон
local mngmni = {1,0}

-- переменные на шанс предмтов на опыт в лавках т2 (2 из 3 = 66% шанс)
local t2var = {0,1,2}

-- переменные на шанс предмтов на опыт в лавке т3 (1 из 2 = 50% шанс)
local t3var = {0,1}

-- переменная расы ГО по банке на перк
local rldr = ''

-- переменная для имени лидера
--local nldr = ''; -- не использую


-- таблицы для переноса остатков предметов после зон т1 т2 для ГО
local tp0prest1 = {}
local tp0prest2 = {}

local p03rest1 = {}
local p03rest2 = {}

local p04rest1 = {}
local p04rest2 = {}

local p05rest1 = {}
local p05rest2 = {}

local pw4rest1 = {}
local pw4rest2 = {}

local pw6rest1 = {}
local pw6rest2 = {}

local flagResp1rest1 = {}
local flagResp1rest2 = {}

local artResp1rest1 = {}
local artResp1rest2 = {}

local relResp1rest1 = {}
local relResp1rest2 = {}

local bootResp1rest1 = {}
local bootResp1rest2 = {}


------

-- Параметры
function getScenarioVariables()
    local vars = {
		-- доход с гоодов 
        {
            name = 'TIER_3_CITY_INCOME',
            value = 50,
        },
        {
            name = 'TIER_4_CITY_INCOME',
            value = 100,
        },
        {
            name = 'TIER_5_CITY_INCOME',
            value = 150,
        },
        {
            name = 'SMNS_INFO_TURN',
            value = smnsit,
        },
		-- ограничение на воровство
		{
		    name = 'ITEM_CAN_STEAL_LESS_COST_SUM',
            value = 501, 
		},
		{
		    name = 'SPELL_CAN_STEAL_LESS_COST_SUM',
            value = 501, 
		},
		
    }
	-- ограницение найма для аутрана
    if gmode == 1 then
        table.insert(vars, {
            name = 'GLOBAL_HIRE_LIMIT_LEADER',
            value = 1,
        })
        table.insert(vars, {
            name = 'GLOBAL_HIRE_LIMIT_ROD',
            value = 1,
        })
        table.insert(vars, {
            name = 'GLOBAL_HIRE_LIMIT_NOBLE',
            value = 1,
        })
    end
	-- модификация "котовасия" parameters[2]
    if kotovasia == 1 then
        table.insert(vars, {
            name = 'HIRE_UNIT_ANY_RACE',
            value = 1,
        })
    end
		-- модификация "+10 точности" parameters[2]
    if accuracy10 == 1 then
        table.insert(vars, {
            name = 'EMPIRE_POWER1_MULTI',
            value = 110,
        })
        table.insert(vars, {
            name = 'CLANS_POWER1_MULTI',
            value = 110,
        })
        table.insert(vars, {
            name = 'HORDES_POWER1_MULTI',
            value = 110,
        })
        table.insert(vars, {
            name = 'LEGIONS_POWER1_MULTI',
            value = 110,
        })
        table.insert(vars, {
            name = 'ELVES_POWER1_MULTI',
            value = 110,
        })
    end
    return vars
end

local BUILDINGS = {
	EMPIRE = {
		L_FIGHTER = {
			{'g000bb0001', 'g000bb0002', 'g000bb0003', 'g000bb0004'}, -- Мастер клинка + Хранитель Ордена
			{'g000bb0001', 'g000bb0002', 'g000bb0003', 'g000bb0005'}, -- Паладин + Кастелян
			{'g000bb0001', 'g000bb0002', 'g000bb0006'},               -- Ангел + Сенешаль
			{'g000bb0007', 'g000bb0008', 'g000bb0009'},               -- Великий Инквизитор + Эмиссар
			{'g000bb0136', 'g000bb0137', 'g000bb0138', 'g000bb0139'}, -- Фанатик + Игнар
		},
		L_ARCHER = {
			{'g000bb0010', 'g000bb0011', 'g000bb0190'}, -- Юстициар
			{'g000bb0010', 'g000bb0131', 'g000bb0132'}, -- Кара Императора
			{'g000bb0170', 'g000bb0171'},               -- Бореалис
		},
		L_MAGE = {
			{'g000bb0012', 'g000bb0013', 'g000bb0014'},               -- Белый Маг
			--{'g000bb0012', 'g000bb0015', 'g000bb0143', 'g000bb0154'}, -- Демиург #SUMMONER
			{'g000bb0012', 'g000bb0182', 'g000bb0183'},               -- Криомант
		},
		L_SPECIAL = {
			{'g000bb0016', 'g000bb0017', 'g000bb0018'}, -- Патриарх
			{'g000bb0016', 'g000bb0168', 'g000bb0169'}, -- Епископ
			{'g000bb0019', 'g000bb0020', 'g000bb0021'}, -- Прорицательница
		},
		L_SIDESHOW = {
			{'g000bb0022', 'g000bb0192'}, -- Рефаим
		},
	},
	CLANS = {
		L_FIGHTER = {
			{'g000bb0026', 'g000bb0027', 'g000bb0028', 'g000bb0029'}, -- Ярл + Гарм
			{'g000bb0026', 'g000bb0027', 'g000bb0028', 'g000bb0030'}, -- Конунг + Гарм
			{'g000bb0026', 'g000bb0027', 'g000bb0133'},               -- Хранитель рун + Гарм
			{'g000bb0026', 'g000bb0031', 'g000bb0032', 'g000bb0158'}, -- Жрец Имира + Белый волк
			--{'g000bb0026', 'g000bb0031', 'g000bb0033'},               -- Повелитель волков + Белый волк #SUMMONER
		},
		L_ARCHER = {
			{'g000bb0034', 'g000bb0035'},               -- Защитник горна
			{'g000bb0034', 'g000bb0036', 'g000bb0142'}, -- Метатель Огня
			{'g000bb0034', 'g000bb0175'},               -- Сотрясатель
		},
		L_MAGE = {
			{'g000bb0037', 'g000bb0038', 'g000bb0039'}, -- Архидруид
			{'g000bb0037', 'g000bb0040', 'g000bb0172'}, -- Эйра
			{'g000bb0037', 'g000bb0173', 'g000bb0174'}, -- Хейса
		},
		L_SPECIAL = {
			{'g000bb0041', 'g000bb0042', 'g000bb0043'},               -- Повелитель Бурь
			{'g000bb0041', 'g000bb0149', 'g000bb0150'},               -- Сын земли
			{'g000bb0041', 'g000bb0044', 'g000bb0045', 'g000bb0123'}, -- Гримтурс
		},
		L_SIDESHOW = {
			{'g000bb0046', 'g000bb0189'}, -- Йамму
		},
	},
	LEGIONS = {
		L_FIGHTER = {
			{ 'g000bb0050', 'g000bb0051', 'g000bb0052' }, -- Возвышенный
			{ 'g000bb0050', 'g000bb0051', 'g000bb0159' }, -- Искоренитель
			{ 'g000bb0050', 'g000bb0125', 'g000bb0126' }, -- Истязатель душ
		},
		L_ARCHER = {
			{ 'g000bb0053', 'g000bb0054' }, -- Ониксовая
			{ 'g000bb0053', 'g000bb0162' }, -- Азуритовая
			{ 'g000bb0176', 'g000bb0177' }, -- Чароитовая
			{ 'g000bb0176', 'g000bb0178' }, -- Цитриновая
		},
		L_MAGE = {
			{ 'g000bb0055', 'g000bb0056', 'g000bb0057', 'g000bb0058' }, -- Модеус
			{ 'g000bb0055', 'g000bb0056', 'g000bb0057', 'g000bb0153' }, -- Барантор
			{ 'g000bb0055', 'g000bb0056', 'g000bb0060', 'g000bb0140' }, -- Якшини
			--{ 'g000bb0055', 'g000bb0059', 'g000bb0157' },               -- Хозяин масок #SUMMONER
			{ 'g000bb0061', 'g000bb0062', 'g000bb0063' },               -- Суккуб
		},
		L_SPECIAL = {
			{ 'g000bb0064', 'g000bb0065', 'g000bb0066', 'g000bb0067' }, -- Тиамат
			{ 'g000bb0064', 'g000bb0065', 'g000bb0068', 'g000bb0069' }, -- Владыка
			{ 'g000bb0064', 'g000bb0065', 'g000bb0068', 'g000bb0070' }, -- Демон бездны
			{ 'g000bb0064', 'g000bb0065', 'g000bb0144', 'g000bb0145' }, -- Багряный ангел
		},
		L_SIDESHOW = {
			{ 'g000bb0071', 'g000bb0181' }, -- Сатир
		},
		L_CUSTOM = {
			{ 'g000bb0186' }, -- Ведьмино отродье
		},
	},
	UNDEAD = {
		L_FIGHTER = {
			{'g000bb0075', 'g000bb0076', 'g000bb0077', 'g000bb0078'}, -- Воин-призрак
			{'g000bb0075', 'g000bb0076', 'g000bb0077', 'g000bb0146'}, -- Черный рыцарь
			{'g000bb0079', 'g000bb0080', 'g000bb0163'},               -- Клеврет смерти
		},
		L_ARCHER = {
			{'g000bb0081', 'g000bb0082'},               -- Тень
			--{'g000bb0081', 'g000bb0191'},                             -- Теневидец #SUMMONER
			{'g000bb0081', 'g000bb0129', 'g000bb0130'}, -- Длань Мортис
			{'g000bb0081', 'g000bb0161'},               -- Эльф-призрак
		},
		L_MAGE = {
			{'g000bb0083', 'g000bb0084', 'g000bb0085', 'g000bb0086'}, -- Верховный Вампир
			{'g000bb0083', 'g000bb0084', 'g000bb0087', 'g000bb0088'}, -- Архилич
			{'g000bb0164', 'g000bb0089', 'g000bb0090', 'g000bb0155'}, -- Драуг
			{'g000bb0164', 'g000bb0089', 'g000bb0091', 'g000bb0141'}, -- Бааванши
		},
		L_SPECIAL = {
			{'g000bb0092', 'g000bb0093', 'g000bb0094'},               -- Вирм + Каган Каменной Пасти
			{'g000bb0092', 'g000bb0093', 'g000bb0095', 'g000bb0127'}, -- Змий разложения + Хан Каменной Пасти
		},
		L_SIDESHOW = {
			{'g000bb0096', 'g000bb0167'}, -- Волколак
			{'g000bb0096', 'g000bb0165'}, -- Чумной оборотень
			{'g000bb0096', 'g000bb0166'}, -- Хорт
		},
	},
	ELVES = {
		L_FIGHTER = {
			{'g000bb0100', 'g000bb0101', 'g000bb0179'}, -- Кераст
			{'g000bb0100', 'g000bb0134', 'g000bb0156'}, -- Штормовой кентавр
			{'g000bb0102', 'g000bb0180'},               -- Кентавр-гвардеец
		},
		L_ARCHER = {
			{'g000bb0103', 'g000bb0104'},                             -- Стингер
			{'g000bb0103', 'g000bb0105', 'g000bb0121', 'g000bb0122'}, -- Мародер
			{'g000bb0103', 'g000bb0105', 'g000bb0135', 'g000bb0152'}, -- Кокильяр
			{'g000bb0106', 'g000bb0107'},                             -- Стражник
			{'g000bb0106', 'g000bb0108'},                             -- Часовой
		},
		L_MAGE = {
			{'g000bb0109', 'g000bb0110'},               -- Тиург
			{'g000bb0109', 'g000bb0111'},               -- Архонт
			{'g000bb0109', 'g000bb0151', 'g000bb0160'}, -- Консул
		},
		L_SPECIAL = {
			{'g000bb0112', 'g000bb0113', 'g000bb0114', 'g000bb0115'}, -- Сильфида
			{'g000bb0112', 'g000bb0113', 'g000bb0124'},               -- Целитель
			{'g000bb0112', 'g000bb0113', 'g000bb0148'},               -- Дриолисса
		},
		L_SIDESHOW = {
			{'g000bb0116', 'g000bb0117', 'g000bb0147'}, -- Владыка Небес
		},
	},
}

function getBuildings(race)
    local buildings = {}

    if kotovasia == 1 then
        for _, raceData in pairs(BUILDINGS) do
            for _, categoryVariants in pairs(raceData) do
                local chosen = categoryVariants[math.random(#categoryVariants)]
                for _, id in pairs(chosen) do
                    table.insert(buildings, id)
                end
            end
        end
    end

    return buildings
end




function kotovasiaGold(value)
    if kotovasia == 1 then
        return math.floor(value / 2)
    end
    return value
end

function applyKotovasiaMines(mines, isStartZone)
    if kotovasia ~= 1 then
        return mines
    end

    -- если НЕ стартовая зона ? убираем золото
    if not isStartZone then
        mines.gold = nil
    end

    return mines
end
------

-- пермо для лавки т0 / т1 / города т1
function gtp0p()
	tp0p = {}
	table.insert(tp0p, 'g001ig0530') -- Зелье посмертного зова (талики)
	table.insert(tp0p, rnd(rnd('g001ig0026','g001ig0130'),'g000ig0010')) -- Аура регенерации | Эликсир регенерации / Эликсир внимательности 10точн 500
	table.insert(tp0p, 'g001ig0524') -- Зелье завоевателя (желы)
	mix(tp0p)
end


-- свиток для лавок т1-т2
function gts1p()
	ts1p = {}
	table.insert(ts1p, 'g000ig5084') -- Свиток "Дар"
	table.insert(ts1p, 'g000ig5119') -- Свиток "Водосточный Колодец"
	table.insert(ts1p, rnd('g000ig5021','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5064','g000ig5101')) -- свиток л.щит, сила, с.кости, с.витара, свиток устр. гимн, слабость, стая

end

-- т. талисманов т1 з.т0 200-300
function gtal1()
	ttal1 = {}
	table.insert(ttal1, rnd('g001ig0267','g001ig0265','g001ig0266','g001ig0264','g000ig9101')) -- призыв
	table.insert(ttal1, rnd('g000ig9105','g000ig9131','g000ig9107')) -- урон
end

-- т. талисманов т2 з.т1 400-500
function gtal2()
	ttal2 = {}
	table.insert(ttal2, 'g000ig9109') -- призыв
	table.insert(ttal2, 'g000ig9120') -- вард
	table.insert(ttal2, 'g001ig0184') -- хил
end

-- т. талисманов т3 з.т2 800
function gtal3()
	ttal3 = {}
	table.insert(ttal3, 'g001ig0259') -- призыв
	table.insert(ttal3, rnd('g000ig9128','g001ig0063')) -- урон
	table.insert(ttal3, 'g000ig9116') -- хил
end

-- т. талисманов т4 з.т3 1000
function gtal4()
	ttal4 = {}
	table.insert(ttal4, 'g001ig0202') -- призыв
	table.insert(ttal4, rnd('g000ig9130','g000ig9123','g000ig9124')) -- урон
end

-- т. талисманов т5 з.т3 1200-1800
function gtal5()
	ttal5 = {}
	table.insert(ttal5, 'g000ig9103') -- призыв
	table.insert(ttal5, rnd('g000ig9136','g001ig0185')) -- урон
end

-- Зелья
-- 100 Эликсир возвышения150 +30бафы / Эликсир защиты от дота / Эликсир защиты от поглощения / Эликсир защиты от проклятий / Эликсир защиты от аффекта
local td15 = {'g001ig0490','g001ig0329','g001ig0351','g001ig0343','g001ig0341'} 
local td15_0 = { }
-- 150 Эликсир защиты / Эликсир ловкости / Эликсир меткости / Эликсир энергии
local tb15 = {'g000ig0002','g000ig0011','g000ig0008','g000ig0014'} 
local tb15_0 = { }
-- 150 Эликсир защиты от магии Воды / .. Воздуха / .. Земли / .. Огня
local tw15 = {'g000ig0022','g000ig0021','g000ig0023','g000ig0024'} 
local tw15_0 = { }
-- 200-375 Эликсир Всевышнего +30бафы / Зелье провокатора 25принять / Зелье пронзающего взгляда +10крит / Эликсир защиты от болезней / Эликсир защиты от поглощения / Эликсир защиты от проклятий / Зелье магической устойчивости 250 (имун магия) / Зелье наблюдательности 250 (15 ворам) / Эликсир защиты от магии Разума 250 / Эликсир защиты от магии Смерти 250
local te2 = {'g001ig0126','g001ig0560','g001ig0547','g001ig0329','g001ig0351','g001ig0343','g002ig0007','g002ig0005','g001ig0125','g001ig0036'}
local te2_0 = { }
-- 400-500 Зелье дуэлянта +20крит / Зелье похищения жизни +25вамп / Зелье тритоньей чешуи +вардурон / Эликсир жизненной силы +50максоз / Эликсир защиты от Оружия / Эликсир защиты от аффекта / Зелье бдительности 500 (30 ворам) / Эликсир скрытого потенциала 350 (+12точ.вт.атаки)
local te4 = {'g001ig0562','g001ig0491','g001ig0355','g001ig0127','g001ig0128','g001ig0341','g002ig0006','g002ig0008'} 
local te4_0 = { }
-- 500 Дубовый эликсир / Эликсир силы / Эликсир скорости 
local tb30 = {'g000ig0003','g000ig0015','g000ig0012'} 
local tb30_0 = { }

function d15() if next(td15) == nil then td15 = td15_0 td15_0 = { } end return rndz(td15,td15_0) end
function b15() if next(tb15) == nil then tb15 = tb15_0 tb15_0 = { } end return rndz(tb15,tb15_0) end
function w15() if next(tw15) == nil then tw15 = tw15_0 tw15_0 = { } end return rndz(tw15,tw15_0) end
function e2() if next(te2) == nil then te2 = te2_0 te2_0 = { } end return rndz(te2,te2_0) end
function e4() if next(te4) == nil then te4 = te4_0 te4_0 = { } end return rndz(te4,te4_0) end
function b30() if next(tb30) == nil then tb30 = tb30_0 tb30_0 = { } end return rndz(tb30,tb30_0) end

------
-- Предметы на опыт для лавки т2: Зелье омоложения разума (-10 опыт), Знамя мастера (+7 отряду), Книга войны (+10 отряду)
local exp1 = {'g001ig0516','g001ig0587','g000ig4005'}

-- Предметы на опыт для лавки т3: Зелье воеводы (+10 отряду), Знамя тысячи битв (+11 отряду)
local exp2 = {'g001ig0523','g001ig0588'}

-- 2x [пермо-банка перк для лавки т1]: Зелье постижения (релики) / Зелье оруженосца (знамя)
local tp2p0 = {'g001ig0527','g001ig0526'}

-- 4x [пермо-банка перк для ГО]: "Честный труд" (сапоги) / Эликсир учености (арты) / Зелье слова (свитки) / Каталог магических сфер
local tp2p = {'g001ig0528','g001ig0525','g001ig0531','g001ig0529'}

-- Лидеры для ГО-14 (до 500)
-- Голем з 450, Йорм вд.вд 508, Привратник ор.вз 400, Ларней вд 436, Сущность бури вз 475, Сущность пламени ог 475, Цитриновая гаргулья ог/раз 430, Некситль ор/ог 342, Вердант з 550
local goldr14 = {'g000uu7509','g000uu7554','g000uu7504','g000uu7551','g000uu8162','g000uu8165','g000uu7574','g000uu7552','g000uu7519'}

-- Лидеры для ГО-24 (500-900)
-- Болотный страж з 775, Вирм с 500, Гибельный рой ж 450, Багряный ангел ж/там 900, Демон Бездны ор/з 900, Зеленый дракон ог 650, Мститель ог 550, Стихийный голем 750, Наместник Вотана вз 500
local goldr24 = {'g000uu7593','g000uu5380','g000uu8210','g000uu8195','g000uu5370','g000uu5123','g000uu7507','g000uu8167','g000uu5358'}

-- Лидеры для ГО-34 (990-1400)
-- Гримтурс вд 990, Желтый дракон з 1440, Костяной голем з 1195, Красный дракон о 1350, Синий дракон вд 1210, Тиамат о/р 900, Белый дракон в 1160, Призрачный дракон рр 1285, Лиргид рс 985
local goldr34 = {'g000uu7500','g000uu8198','g000uu7520','g000uu5119','g000uu5121','g000uu5368','g000uu5120','g000uu8217','g000uu7555'}

-- Лидеры для ГО-3t
-- Бомбарда жо 1250, Ангел Перерожденный жж 1350, Болотный дракон жвд 1775, Исчадие жж 1500, Королева эльфов ж/ор 1500, Кровавый дракон ж 1550, Серный змей жо 1900, Черный дракон ж/ж 1620
local goldr3t = {'g000uu8149','g000uu7503','g000uu8268','g000uu8104','g000uu6018','g000uu8269','g000uu8270','g000uu5122'}

-- Лидеры для ГО-t4 фракционные для ldhero(race)
local goldrt4hm = {'g000uu0019','g000uu0020','g000uu8248'}
local goldrt4dw = {'g000uu0044','g000uu0045','g000uu8249'}
local goldrt4un = {'g000uu0096','g000uu8252','g000uu8253'}
local goldrt4hr = {'g000uu0070','g000uu0071','g000uu8250'}
local goldrt4el = {'g000uu8009','g000uu8011','g000uu8251'}

-- Сферы
-- 100 Сферы т1 в цель: Камня, Костра, Ледяного осколка, Статического разряда, Чумы, Пыток
local torb11 = {'g001ig0189','g001ig0178','g001ig0472','g001ig0473','g000ig9033','g001ig0192'} 

-- 100 Сферы т1 аое: Ливня, Углей, Шторма, Подавления
local torb12 = {'g000ig9031','g000ig9022','g001ig0302','g001ig0470'} 

--сферы200 + очищения400: Сфера Каменного проклятия250, Сфера переохлаждения250, Сфера Брони I +15брони-1 200, Вампиризма I +20вамп-1 200, Восстановления 30хил-аое 200, Охотника 40урона-1 200, Разрушения доспеха I -15брони-1 200, Урона I +20урон-1 200, Очищения 400
local orb200RespZ = {'g001ig0458','g001ig0478','g001ig0133','g001ig0446','g000ig9017','g001ig0471','g001ig0464','g001ig0450','g001ig0157'}

--сферы400-699: 
local orb400RespZ = {'g001ig0304','g001ig0443','g001ig0467','g001ig0191','g001ig0176','g000ig9024','g001ig0295','g001ig0056','g001ig0054','g001ig0055','g001ig0053','g001ig0058','g001ig0057','g001ig0461','g001ig0300','g001ig0496','g000ig9042','g001ig0475','g001ig0468','g001ig0157','g001ig0187','g001ig0469','g001ig0454','g001ig0456','g000ig9018','g001ig0479','g001ig0453','g001ig0474','g001ig0134'}

--сферы700-799: 
local orbZone34 = {'g000ig9021','g000ig9016','g000ig9028','g001ig0203','g001ig0466','g001ig0462','g001ig0183','g001ig0455','g001ig0489'} -- ,'g001ig0131'

--сферы800+ только центр: 
local orbZone5 = {'g000ig9025','g001ig0136','g001ig0480','g001ig0303','g001ig0059','g001ig0459','g000ig9023','g001ig0457','g000ig9014','g000ig9040','g000ig9007','g001ig0181','g001ig0477','g000ig9027','g000ig9032'}

-- Пермо банки
--3x пермо200+ ГО14: Эликсир маскировки -50%озу 200, Война престолов -10воры 400, Зелье дозорного 200
local p03 = {'g001ig0006','g001ig0519','g001ig0532'}

--3x пермо400+ ГО24: Дары Галлеана (Хождение по лесу) 550, Аура жизненной силы +10оз_отряду 400, Зелье великана +5%оз 400, Зелье ясного взора (+2 обзора)
local p04 = {'g001ig0501','g001ig0034','g001ig0315','g001ig0533'}

--5x пермо400-5%: Эликсир задиры +5ини, Эликсир совершенствования +5урон, Эликсир хладнокровия +5точности, Зелье стойкости +5брони, Зелье рвения +5ини_точн
local p05 = {'g001ig0309','g001ig0313','g001ig0311','g001ig0307','g001ig0083'}

--8x пермо400+ пермо-вард-эффект-дот: Эликсир неудержимости -ослабление, Эликсир норн -страх, Эликсир предназначения -замедление, Эликсир мудрости Лазгурона -понижение уровня 600, Зелье ихора Танатоса -яд, Эликсир ледяной плоти -мороз, Эликсир Неопалимых -горение, Жидкий металл Уру -разрушение 450
local pw4 = {'g001ig0346','g001ig0342','g001ig0344','g001ig0348','g001ig0332','g001ig0328','g001ig0330','g001ig0354'}

--5x пермо600-вард-стихия+ау.метк.: Зелье глубинного чудища -вода, Зелье родства с пламенем -огонь, Зелье текучего камня -земля, Зелье укротителя небосвода -воздух, Аура меткости +10точн 600, Эликсир обновления (+30 реген) 800
local pw6 = {'g001ig0320','g001ig0323','g001ig0322','g001ig0321','g001ig0022','g001ig0376'}

--разные на всей карте (в основном центр) для обоих игроков rndy(должно_хватать)
--10x пермо600+ ГО3тренер: Эликсир мощи 625, Эликсир неуловимости 650, Эликсир твердости 730, Зелье удачи (5 крит) 700, Зелье загробных тайн (вард оружие) 900, Экстракт таинственной энергии (Меняет источник атаки) 700, Зелье разоблачения (-20 воры) 1000, Эликсир самопожертвования -25телохранитель 600
local p06 = {'g000ig0016','g000ig0013','g000ig0004','g001ig0548','g001ig0324','g001ig0534','g001ig0521','g001ig0561'}
--6x пермо800+ пермо-вард-спец: Зелье здравомыслия (защита от разума) 900, Зелье немертвых (защита от смерти) 900, Эликсир павших оков (защита от окаменения) 800, Эликсир непоколебимости (защита паралича) 800, Эликсир безраздельности (иммунитет к имитации) 800, Эликсир непорочности (защита от полиморфа) 800, Эликсир гонителя нечисти (защиту от Вампиризма и Тауматургии) 800
local pw8 = {'g001ig0325','g001ig0326','g001ig0336','g001ig0338','g001ig0334','g001ig0340','g001ig0352'}

--сферы700-799 на дамаг для сундука центра
local orbZoneD34 = {'g000ig9028','g001ig0466','g001ig0489'}


----
-- Для лавки т0
--арты300: наручи, р.камень, Цепи жертвенности, Цеп Хана
local artRespZ0 = {'g000ig3001','g000ig2001','g001ig0611','g001ig0100'}

-- релики400: Фолиант секретов смерти, Книга Огня, Книга воздуха, Книга тайного знания, Книга воды, Книга божественных даров, Книга колдовства, Книга наследия, Книга странника, Кожаные эльфийские доспехи, Куртка капитана, Череп Хана
local relRespZ0 = {'g000ig3020','g000ig4004','g000ig4001','g000ig4006','g000ig4002','g001ig0493','g001ig0497','g001ig0495','g001ig0494','g001ig0428','g001ig0426','g001ig0101'}

-- сапоги300: Литейные сапоги (огонь) / Сапоги ветров (воздух) / Гномьи сапоги (вода) / Сапоги каменщика (земли)
local bootRespZ0 = {'g001ig0105','g001ig0107','g001ig0108','g001ig0106'}


-- Для лавки т1
--арты301-500: 
local artRespZ = {'g001ig0048','g001ig0609','g002ig0001','g001ig0418','g000ig2002','g001ig0182'}

--релики500: Борода Имира, Книга земли, Медицинский трактат, Обод мертвых, Перчатки дуэлянта, Череп Танатоса, Книга постижения 600
local relRespZ = {'g001ig0421','g000ig4003','g000ig4007','g000ig3008','g001ig0099','g000ig4008','g001ig0605'}

--сапоги300: сапоги укрепл 300 / лёгкие 300 / Ботинки исследователя 500
local bootRespZ = {'g001ig0113','g001ig0110','g002ig0022'}

--знамёна400-500: защиты, выносл, силы, сражения
local flagRespZ = {'g000ig1001','g001ig0051','g000ig1007','g000ig1003'}


-- Для лавок т2
--арты501-999 x 20: 
local artResp1 = {'g001ig0415','g001ig0590','g000ig3002','g001ig0582','g000ig3017','g001ig0042','g000ig3003','g001ig0487','g001ig0045','g000ig2003','g001ig0173','g001ig0197','g001ig0558','g001ig0557','g001ig0559','g001ig0417','g001ig0047','g001ig0416','g001ig0196','g000ig9137','g001ig0589','g001ig0591','g001ig0594'}

--релики525-850 x 13: зуб людоеда, лютня525, Вечные латы, Кровавый покров, Шлем проклятого, Оковы долга
--таира чистоты, Латы Спасителя, Роба убийцы, Промасленная кольчуга, Нагрудник Стража, Одеяния из шкуры зверя, Доспех жатвы
local relResp1 = {'g001ig0104','g000ig3022','g001ig0420','g001ig0422','g001ig0037','g001ig0610','g000ig2006','g001ig0423','g001ig0430','g002ig0002','g001ig0427','g001ig0429','g001ig0602'}

--знамёна501-799 x 20: 
local flagResp1 = {'g001ig0500','g002ig0021','g001ig0293','g000ig1004','g000ig1005','g001ig0361','g001ig0289','g001ig0370','g001ig0142','g001ig0140','g001ig0141','g001ig0139','g001ig0145','g001ig0143','g001ig0363','g001ig0369','g000ig1008','g001ig0365','g001ig0292','g001ig0367'}

--сапоги500-750 x 4
-- Сапоги скорости 450 / Сапоги ассасина / Эльфийские сапоги / Тяжелые сапоги
local bootResp1 = {'g000ig8003','g001ig0111','g000ig1010','g001ig0114'}


-- Для лавки т3
--арты1000-1399  -Кольцо веков -Ржавые кандалы -Сердце океана +Щит рыцаря Феникса 1500
local artZone34 = {'g001ig0174','g001ig0124','g000ig3019','g001ig0612','g001ig0413','g001ig0592','g002ig0019','g001ig0040','g000ig2004','g000ig3004','g000ig9035','g001ig0657','g001ig0060','g001ig0158','g001ig0603','g001ig0041','g001ig0071','g002ig0011'}

--релики900-1500 +2100ворон: шкатулка800, Кираса резонанса, Тисовый лук, Длани ангела, Кафтан первооткрывателя, Шлем воителя, Кираса Кровавого Ворона
local relZone34 = {'g001ig0156','g001ig0597','g001ig0539','g001ig0424','g001ig0425','g001ig0419','g002ig0015'}

--знамёна801-1100:
local flagZone34 = {'g001ig0362','g001ig0364','g001ig0357','g000ig1002','g001ig0358','g000ig1006','g001ig0374','g001ig0375','g001ig0359'}

--сапоги1000: Сапоги путешественника750 / Сапоги родных земель1000
local bootZone34 = {'g000ig8004','g001ig0606'}

-- Для лавки т4 (центр)
--арты1400-1900: минус: -Боевая коса -Кольцо веков -Кольцо Колдуньи -Кольцо плута
local artZone5 = {'g001ig0155','g000ig2005','g001ig0411','g001ig0410','g002ig0014','g001ig0604','g000ig3018','g001ig0102','g001ig0488','g001ig0585','g002ig0017','g000ig3015','g001ig0046','g002ig0010','g000ig3016','g002ig0013','g001ig0412'}

--релики : плас.досп, кор.имп, тяж.латы, кор.мьолн1400, Доспех рыцаря Феникса
local relZone5 = {'g001ig0116','g000ig7010','g001ig0038','g000ig3005','g002ig0012'}

--знамёна1200-1400: Знамя вампиризма / Знамя стойких / Стяг непреклонности / Стяг упырей / Штандарт равновесия / Стяг главаря наемников
local flagZone5 = {'g001ig0153','g001ig0052','g001ig0290','g001ig0360','g001ig0291','g002ig0003'}

--сапоги1100-1300: Железная поступь / Крылья ангела / Семимильные сапоги1300
local bootZone5 = {'g001ig0115','g001ig0112','g000ig8005'}

--
-- Лавка т0 на Респе
function zoneMerchRespZ0()

return {
	{
		goods = {
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 2 }, --15
				{ id = 'g000ig0011', min = 1, max = 2 }, --15
				{ id = 'g000ig0008', min = 1, max = 2 }, --15
				{ id = 'g000ig0014', min = 1, max = 2 }, --15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				
				{ id = rnd('g001ig0125','g001ig0036','g001ig0036'), min = 1, max = 1 }, -- вард разума/вард смерти/вард смерти

				-- банка на талики / реген / точность
				-- { id = rndy(tp0p), min = 1, max = 1 },
				-- пермо200+
				{ id = p03[1], min = 1, max = 1 },

				--арты
				{ id = artRespZ0[1], min = 1, max = 1 },
				{ id = artRespZ0[2], min = 1, max = 1 },

				--релики
				{ id = relRespZ0[1], min = 1, max = 1 },
				{ id = relRespZ0[2], min = 1, max = 1 },

				--сапоги
				{ id = bootRespZ0[1], min = 1, max = 1 }, -- 

				--сферы 100
				{ id = torb11[3], min = 1, max = 1 }, -- Сфера 100 в цель
				{ id = torb12[3], min = 1, max = 1 }, -- Сфера 100 аое
				--сферы 200
				{ id = orb200RespZ[1], min = 1, max = 1 },

				--посох
				{ id = rnd('g001ig0383','g001ig0387','g000ig6001','g000ig6003'), min = 1, max = 1 }, -- Посох первых побегов (малый энт) / Посох следопыта (хождение по лесу) / Посох грома (15 дамаг) /  Посох святости (30 хила)

				--талик
				{ id = rndy(ttal1), min = 1, max = 1}, -- талик т1

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				-- т1 свитки
				-- призыв+обзорка: Incantare Hellhound, Рух, Скелет, Энт Малый, Истинное зрение, Соколиная зоркость
				-- статы: tormentio-броня, Menta minoris, Быстрота, Неудача, Ржавчина, Смятение, Стойкость рощи
				-- ударка: Ignis mare, Буран, Кустарник, Молния, Мор
				{ id = rnd(rnd('g000ig5041','g000ig5025','g000ig5061','g000ig5098','g000ig5009','g001ig0072'),rnd('g000ig5045','g000ig5044','g000ig5002','g001ig0247','g000ig5065','g000ig5106','g000ig5102'),rnd('g000ig5043','g000ig5024','g000ig5097','g000ig5004','g000ig5062')), min = 1, max = 1},
			}
		},
			guard = gmm({}, guard0()),
	}
}
end


-- Лавка т1
function zoneMerchRespZ()
return {
	{
		goods = {
			items = {
				{ id = 'g000ig0001', min = 3, max = 4 },
				{ id = 'g000ig0006', min = 3, max = 4 },
				{ id = 'g001ig0378', min = 4, max = 5 }, --хил75
				{ id = 'g000ig0005', min = 5, max = 7 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = 'g000ig0008', min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 1 }, -- возд.вард
				{ id = w15(), min = 1, max = 1 }, -- вард
				{ id = w15(), min = 1, max = 1 }, -- вард
				{ id = w15(), min = 1, max = 1 }, -- вард

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				
				{ id = rnd('g001ig0125','g001ig0125','g001ig0036'), min = 1, max = 1 }, -- вард разума/вард разума/вард смерти
				{ id = e2(), min = 1, max = 1 }, --эл200
				
				-- банка на перк
				{ id = rndy(tp2p0), min = 1, max = 1 },

				-- пермо400+ / пермо-вард-эффект-дот
				{ id = rnd(p04[1],pw4[1]), min = 1, max = 1 },

				-- банка на талики / реген-точность / банка на жезлы
				{ id = tp0p[1], min = 1, max = 1 },

				--арты
				{ id = artRespZ[1], min = 1, max = 1 },
				{ id = artRespZ[2], min = 1, max = 1 },

				--релики
				{ id = relRespZ[1], min = 1, max = 1 },
				{ id = relRespZ[2], min = 1, max = 1 },

				--сапоги
				{ id = bootRespZ[1], min = 1, max = 1 },

				--посох
				{ id = rnd('g001ig0394','g000ig6012','g001ig0395','g001ig0399'), min = 1, max = 1 }, -- Посох северных стражей+10брони / Посох скорости+10ини / Посох наместника Махаля+10брони / Посох раздора-10ини

				--талик
				{ id = rndy(ttal2), min = 1, max = 1}, -- талик т2

				--знамёна
				{ id = flagRespZ[1], min = 1, max = 1 },
				{ id = flagRespZ[2], min = 1, max = 1 },

				--сферы200
				{ id = orb200RespZ[2], min = 1, max = 1 },
				{ id = orb200RespZ[3], min = 1, max = 1 },
				--сферы400
				{ id = orb400RespZ[1], min = 1, max = 1 },

				--свитки
				{ id = rnd('g000ig5007','g000ig5029'), min = 1, max = 1 }, -- св. исцеление / рит. исцеления
				{ id = rndy(ts1p), min = 1, max = 1}, -- свиток дар / в.колодец / случ.т1
				-- т1 свитки
				-- призыв+обзорка: Incantare Hellhound, Рух, Скелет, Энт Малый, Истинное зрение, Соколиная зоркость
				-- статы: tormentio-броня, Menta minoris, Быстрота, Неудача, Ржавчина, Смятение, Стойкость рощи
				-- ударка: Ignis mare, Буран, Кустарник, Молния, Мор
				{ id = rnd(rnd('g000ig5041','g000ig5025','g000ig5061','g000ig5098','g000ig5009','g001ig0072'),rnd('g000ig5045','g000ig5044','g000ig5002','g001ig0247','g000ig5065','g000ig5106','g000ig5102'),rnd('g000ig5043','g000ig5024','g000ig5097','g000ig5004','g000ig5062')), min = 1, max = 1},
			}
		},
			guard = gmm({}, guard1()),
	}
}
end

-- Лавка т2
function zoneMerchResp()
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард

				{ id = 'g001ig0125', min = 1, max = 1 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 1 }, -- вард смерти
				yn({ id = rnd('g001ig0125','g001ig0036','g001ig0036'), min = 1, max = 1 }), --разума/смерти/смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				
				{ id = e2(), min = 1, max = 1 }, --эл200
				{ id = e4(), min = 1, max = 1 }, --эл400
					
				-- пермо400-5% / пермо600-вард-стихия+ау.метк.
				{ id = rnd(p05[1],pw6[1]), min = 1, max = 1 },	
				-- пермо-вард-эффект-дот
				{ id = pw4[2], min = 1, max = 1 },
				
				-- на опыт 0
				{ id = expt2go(0), min = 1, max = 1 },
							
				--арты
				{ id = artResp1[1], min = 1, max = 1 },
				{ id = artResp1[2], min = 1, max = 1 },

				--релики
				{ id = relResp1[1], min = 1, max = 1 },
				{ id = relResp1[2], min = 1, max = 1 },

				--сапоги
				{ id = bootResp1[1], min = 1, max = 1 },

				--знамёна
				{ id = flagResp1[1], min = 1, max = 1 },
				{ id = flagResp1[2], min = 1, max = 1 },

				--доп. арт/арт/релик/знамя
				{ id = rnd(artResp1[3],artResp1[3],relResp1[3],flagResp1[3]), min = 1, max = 1 },

				--сферы
				{ id = orb400RespZ[2], min = 1, max = 1 },
				{ id = orb400RespZ[3], min = 1, max = 1 },
				{ id = orb400RespZ[4], min = 1, max = 1 },
				{ id = orb400RespZ[5], min = 1, max = 1 },

				--посох
				orr(orr({ id = 'g001ig0404', min = 1, max = 1 }, { id = 'g001ig0401', min = 1, max = 1 }), { id = 'g001ig0398', min = 1, max = 1 }), -- Посох Ниграэля-15урона / Посох проклятой метки-15урона | Посох скальда+15ини

				--талик
				{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rndy(ts1p), min = 1, max = 1}, -- свиток дар / в.колодец / случ.т1
			}
		},
		guard = gmm({}, guard2()),
	},

		{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 400, max = 400 },
			itemValue = { min = 400, max = 400 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7}, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g001ig0180', min = 7, max = 10 },

				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
				{ id = 'g000ig0008', min = 1, max = 1 }, --точность15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0022', min = 1, max = 2 }, -- вард
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
				{ id = 'g000ig0024', min = 1, max = 2 }, -- вард

				{ id = 'g001ig0125', min = 1, max = 1 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 1 }, -- вард смерти
				yn({ id = rnd('g001ig0125','g001ig0125','g001ig0036'), min = 1, max = 1 }), --разума/разума/смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				
				{ id = e2(), min = 1, max = 1 }, --эл200
				{ id = e4(), min = 1, max = 1 }, --эл400
					
				-- пермо400-5% / пермо600-вард-стихия+ау.метк.
				{ id = rnd(p05[2],pw6[2]), min = 1, max = 1 },
				-- пермо-вард-эффект-дот
				{ id = pw4[3], min = 1, max = 1 },

				-- на опыт 1
				{ id = expt2go(1), min = 1, max = 1 },

				--арты
				{ id = artResp1[4], min = 1, max = 1 },
				{ id = artResp1[5], min = 1, max = 1 },

				--релики
				{ id = relResp1[4], min = 1, max = 1 },
				{ id = relResp1[5], min = 1, max = 1 },

				--знамёна
				{ id = flagResp1[4], min = 1, max = 1 },
				{ id = flagResp1[5], min = 1, max = 1 },

				--доп. арт/арт/релик/знамя
				{ id = rnd(artResp1[6],artResp1[6],relResp1[6],flagResp1[6]), min = 1, max = 1 },

				--сапоги
				{ id = bootResp1[2], min = 1, max = 1 },

				--сферы
				{ id = orb400RespZ[6], min = 1, max = 1 },
				{ id = orb400RespZ[7], min = 1, max = 1 },
				{ id = orb400RespZ[8], min = 1, max = 1 },
				{ id = orb400RespZ[9], min = 1, max = 1 },

				--посох
				orr({ id = 'g001ig0392', min = 1, max = 1 }, orr({ id = 'g000ig6019', min = 1, max = 1 }, { id = 'g001ig0403', min = 1, max = 1 })), -- Посох знаний Фрегги+40хил | Посох Листвы+лес / Посох неизбежной кары +10 урона и точности

				--талик
				{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3

				--свитки
				orr({ id = 'g000ig5007', min = 1, max = 1 }, { id = 'g000ig5029', min = 1, max = 1 }), -- св. исцеление / рит. исцеления
				{ id = rndy(ts1p), min = 1, max = 1}, -- свиток дар / в.колодец / случ.т1
			}
		},
		guard = gmm({}, guard2()),
	},

}
end

-- Лавка т3
function zoneMerchZone34() -- свиток т3
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 550, max = 550 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 6, max = 7 }, --хил75
				{ id = 'g000ig0005', min = 7, max = 10 },
				{ id = 'g000ig0018', min = 1, max = 1 },

				{ id = b30(), min = 1, max = 1 }, --сл.банка30
				{ id = b30(), min = 1, max = 1 }, --сл.банка30

				{ id = 'g000ig0011', min = 1, max = 1 }, --ини15
				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = 'g000ig0021', min = 1, max = 1 }, -- вард воздух
				{ id = 'g000ig0022', min = 1, max = 1 }, -- вард вода
				{ id = 'g000ig0023', min = 1, max = 1 }, -- вард земля
				{ id = 'g000ig0024', min = 1, max = 1 }, -- вард огонь
				{ id = w15(), min = 1, max = 1 }, -- сл.вард
				{ id = w15(), min = 1, max = 1 }, -- сл.вард

				{ id = 'g001ig0128', min = 1, max = 1 }, -- вард оружия
				{ id = 'g001ig0125', min = 1, max = 2 }, -- вард разума
				{ id = 'g001ig0036', min = 1, max = 2 }, -- вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				
				{ id = e2(), min = 1, max = 1 }, --эл200
				{ id = e4(), min = 1, max = 1 }, -- 
				{ id = rnd(e4(),'g002ig0009'), min = 1, max = 1 }, -- e4 / Эликсир очищения
				
				-- пермо600+ / пермо-вард-спец
				{ id = rnd(rndy(p06),rndy(pw8)), min = 1, max = 1 },
				
				-- на опыт
				{ id = expt3go(), min = 1, max = 1 },			

				--арты
				{ id = artZone34[1], min = 1, max = 1 },
				{ id = artZone34[2], min = 1, max = 1 },
				{ id = artZone34[3], min = 1, max = 1 },

				--релики
				{ id = relZone34[1], min = 1, max = 1 },
				{ id = relZone34[2], min = 1, max = 1 },

				--знамёна
				{ id = flagZone34[1], min = 1, max = 1 },
				{ id = flagZone34[2], min = 1, max = 1 },

				--доп. релик/знамя
				{ id = rnd(relZone34[3],flagZone34[3]), min = 1, max = 1 },

				--сферы
				{ id = orbZone34[1], min = 1, max = 1 },
				{ id = orbZone34[2], min = 1, max = 1 },
				{ id = orbZone34[3], min = 1, max = 1 },
				{ id = orbZone34[4], min = 1, max = 1 },

				--сапоги
				{ id = bootZone34[1], min = 1, max = 1 },

				--посох
				{ id = rnd('g000ig6020', 'g001ig0380', 'g000ig6021', 'g001ig0391'), min = 1, max = 1 }, -- Посох Возни-15точ-10урона / Посох врат Бездны-белик / Посох Зов Леса-энт2 / Посох оракула+60хил

				--талик
				{ id = rndy(ttal4), min = 1, max = 1}, -- талик т4

				--свитки
				orr({ id = 'g000ig5110', min = 1, max = 1 }, { id = 'g000ig5040', min = 1, max = 1 }), -- Излечение +60 аое / Песнь Вотана +100
				{ id = rnd('g001ig0194','g000ig5022','g001ig0492'), min = 1, max = 1 }, -- Свиток "Лисья хитрость" / Свиток "Хождение по лесу" / Свиток "Проведение Всевышнего" (сферы)
			}
		},
		guard = gmm({}, guard3()),
	},

}
end

-- Лавка т4
function zoneMerchZone5() -- свитки т2+т3
return {
	{
		goods = {
			itemTypes = { Item.Scroll },
			value = { min = 550, max = 550 },
			itemValue = { min = 550, max = 550 },
			items = {
				{ id = 'g000ig0001', min = 5, max = 6 },
				{ id = 'g000ig0006', min = 5, max = 6 },
				{ id = 'g001ig0378', min = 2, max = 3 }, --хил75
				{ id = 'g000ig0018', min = 1, max = 1 },

				{ id = 'g000ig0015', min = 1, max = 1 }, --урон30
				{ id = 'g000ig0012', min = 1, max = 1 }, --ини30
				{ id = b30(), min = 1, max = 1 }, --сл.банка30

				{ id = 'g000ig0002', min = 1, max = 1 }, --защита15
				{ id = 'g000ig0014', min = 1, max = 1 }, --атака15
				{ id = b15(), min = 1, max = 1 }, --15

				{ id = rnd('g000ig0021','g000ig0024'), min = 1, max = 1 }, -- вард воздух / огонь
				{ id = rnd('g000ig0022','g000ig0023'), min = 1, max = 1 }, -- вард вода / земля
				{ id = w15(), min = 1, max = 1 }, -- сл.вард

				{ id = rnd('g001ig0128','g001ig0128','g001ig0125','g001ig0036'), min = 1, max = 1 }, -- вард оружия /вард оружия / вард разума / вард смерти

				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = d15(), min = 1, max = 1}, -- случ. дотвард
				{ id = e2(), min = 1, max = 1 }, --
				{ id = rnd(e4(),'g002ig0009','g002ig0009'), min = 1, max = 1 }, -- e4 / Эликсир очищения / Эликсир очищения

				--арты
				{ id = artZone5[1], min = 1, max = 1 },
				{ id = artZone5[2], min = 1, max = 1 },

				--релики
				{ id = relZone5[1], min = 1, max = 1 },
				{ id = relZone5[2], min = 1, max = 1 },

				--знамёна
				{ id = flagZone5[1], min = 1, max = 1 },
				{ id = flagZone5[2], min = 1, max = 1 },

				--доп. арт/релик/знамя|Штандарт Бернинга
				{ id = rnd(artZone5[3],relZone5[3],rnd(flagZone5[3],'g001ig0373')), min = 1, max = 1 }, -- 

				--сферы
				{ id = orbZone5[1], min = 1, max = 1 },
				{ id = orbZone5[2], min = 1, max = 1 },
				{ id = orbZone5[3], min = 1, max = 1 },
				{ id = orbZone5[4], min = 1, max = 1 },

				--сапоги
				{ id = bootZone5[1], min = 1, max = 1 },

				--посох
				orr({ id = 'g001ig0097', min = 1, max = 1 }, { id = 'g000ig6019', min = 1, max = 1 }), -- Посох озер / Посох Листвы

				--талик
				{ id = rndy(ttal5), min = 1, max = 1}, -- талик т5

				-- Свиток "Merum Facies" -окамен.полиморф, "Слабость плоти" -оружие, "Слабость разума" -разум, "Пробирающий холод" -вода,
				-- "Dominatum ignis" - огонь, "Небесный молот" -воздух, "Хворь" -земля, "Прах к праху" -смерть, Свиток "Забвение" -свитки/сферы/талики
				{ id = rnd('g000ig5057','g001ig0573','g001ig0574','g001ig0578','g001ig0577','g001ig0580','g001ig0579','g001ig0576','g001ig0165'), min = 1, max = 1 },
				orr({ id = 'g000ig5110', min = 1, max = 1 }, { id = 'g000ig5040', min = 1, max = 1 }), -- Излечение +60 аое / Песнь Вотана +100

				--{ id = fbanka(2), min = 1, max = 1 }, -- Зелье завоевателя (желы)

			}
		},
		guard = gmm({}, guard4()),
		--guard = guardbanka(3),
	},
	}
end


---------------------

	-- Заклы баш_т2 т1статы*5шт : быстрота +7и, Menta minoris -5у.т., слабость -5уи, стая -10у, Стойкость рощи +15оз
	local tblmg2t1 = {'g000ss0002','g000ss0044','g000ss0064','g000ss0101','g000ss0102'}
	-- Заклы баш_т2 т1двойные_бафы*4шт : Ледяной щит / Стальные кости +7б, сила витара / сила +10у
	local tblmg2t1b = {'g000ss0021','g000ss0181','g000ss0023','g000ss0003'}
	-- Заклы баш_т2 т1двойные_дебафы*6шт : tormentio / Ржавчина -10б, Порченная руна / неудача -10т, Смятение / Устрашающий гимн -10и
	local tblmg2t1d = {'g000ss0045','g000ss0065','g000ss0134','g000ss0178','g000ss0106','g000ss0179'}

	-- Заклы баш_т2 т12*6шт : Дикие саженцы / Исцеление / Ритуал исцеления / Заступничество / Отсрочка неизбежного / Соколиная зоркость
	local tblmg2t2 = {'g000ss0107','g000ss0007','g000ss0029','g000ss0197','g000ss0124','g000ss0126'}

--Башня магии в зоне 2
function zoneMageResp()
	mix(tblmg2t1)
	mix(tblmg2t1b)
	mix(tblmg2t1d)
	mix(tblmg2t2)
	return {
		{
			spells = { 	tblmg2t1[1], tblmg2t1[2],
						tblmg2t1b[1],
						tblmg2t1d[1],
						tblmg2t2[1], tblmg2t2[2], tblmg2t2[3],
			},
			guard = gmm({}, guard2m())
		}
	}
end

	-- Заклы баш_т3
	-- Заклы баш_т3 т2статы*8шт : сокрушение -15броня, прокл.эмира -15урон / Cursa demoneus -15урон, terebrare corde -10точ.урон, Chronos -15ини, Спешащее время +10ини5урон, могущество +15урон, Песнь слез -10точность, Заколдованное оружие +10точн.вард.осл
	local tblmg3t2 = {'g000ss0183','g000ss0184','g000ss0185','g000ss0050','g000ss0186','g000ss0187','g000ss0133','g000ss0034'}

	-- т3*7шт : Призыв II: Валькирия / Призыв III: Энт Большой, Туман Смерти, Божественная мудрость (+15 опыт), Затопление, Излечение (+60 хил), Искусный торговец -20% скидка
	local tblmg3t3 = {'g000ss0031','g000ss0108','g000ss0074','g000ss0175','g000ss0144','g000ss0110','g000ss0085'}

	-- т45*7шт : Неподкупность, Merum facies -окам полим, Слабость плоти -оружие, Слабость разума -разум, Песнь Вотана +100 хил, Призыв IV: Танатос, Сумерки -закрывает карту, Пламенные небеса -30 вард от магии и бафы
	local tblmg3t4 = {'g000ss0039','g000ss0127','g000ss0202','g000ss0203','g000ss0040','g000ss0078','g000ss0095','g000ss0057'}

	-- минус_вард+_доп*5шт : Dominatum ignis -вард огонь, Небесный молот -вард воздух, Пробирающий холод -вард вода, Хворь -вард земля, Забвение -свитки сферы талики
	local tblmg3tw = {'g000ss0206','g000ss0209','g000ss0207','g000ss0208'}

	-- ударка-40взоне*4шт : Potentia Ignis, Духи льда, Лавина, Смерч Смерти, Цепь молний
	local tblmg3tu = {'g000ss0090','g000ss0086','g000ss0112','g000ss0093','g000ss0081'}

	--

--Башня магии в зоне 3
function zoneMageZone34()
	mix(tblmg3t2)
	mix(tblmg3t3)
	mix(tblmg3t4)
	mix(tblmg3tw)
	mix(tblmg3tu)
	return {
		{
			spells = { 	tblmg3t2[1], tblmg3t2[2], tblmg3t2[3],
						tblmg3t3[1],
						tblmg3t4[1],
						tblmg3tw[1],
						tblmg3tu[1],
			},
			guard = guard3m()
		}
	}
end


--Башня магии в центральной зоне
function zoneMageTrainer()
	return {
		{
			spells = {
						rnd('g000ss0048','g000ss0067','g000ss0028','g000ss0104','g000ss0070'), -- Ignis carn / Чума / Ледяной столб / Опаление / Каменный дождь
						rnd('g000ss0001','g000ss0010','g000ss0180','g000ss0182'), -- Защита от магии Воздуха / Защита от магии Земли / Ardenti aqua / Спокойствие пламени
						rnd('g000ss0119','g000ss0022'), -- Водосточный колодец / Хождение по лесу
						rnd('g000ss0147','g000ss0020','g000ss0300'), -- Infernus (-крит,-РБ,-вампирик) / Приказ сира Аллемона / Забвение (-свитки, посохи, сферы, талики)
						rnd('g000ss0152','g000ss0176'), -- Подкуп / Лисья хитрость
						rnd('g000ss0030','g000ss0068','g000ss0041','g000ss0047'), -- Взгляд Сивиллы / Тень / Incantare Hellhound / Incantare Beliarh Illudere


--						rnd('g000ss0043','g000ss0024','g000ss0097','g000ss0004','g000ss0062'), -- Ignis mare / Буран / Кустарник / Молния / Мор
--						rnd(rnd('g000ss0192','g000ss0191'),'g000ss0177'), -- Песнь Мимира | Проведение Всевышнего / Откровение
			},
			guard = gmm({}, guard4()),
		}
	}
end

----------------------

-- Город т1

local tierTowerResp0 = 1

function zoneTownsResp0(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerResp0,
		gapMask = 15,
		stack = {
		subraceTypes = rsub(),
			value = { min = gmm(250,300)*kef, max = gmm(263,315)*kef },
			loot = {
				items = {
					{ id = 'g000ig0001', min = 1, max = 1 }, --рес
					{ id = 'g000ig0006', min = gmm(1,2), max = gmm(1,2) }, -- хил100
					orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), -- хил25*2/хил 50
					gmm({ id = 'g000ig7001', min = 1, max = 1 }, { id = 'g000ig7002', min = 1, max = 1 }), -- кольцо50 || кольцо100
					{ id = w15(), min = 1, max = 1 }, --вард15
					{ id = b15(), min = 1, max = 1 }, --банка15
					{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15

					-- банка на талики / реген-точность / банка на жезлы
					{ id = tp0p[2], min = 1, max = 1 },
					
					-- пермо-вард-эффект-дот / случ.шар
					{ id = rnd(pw4[4],ExtraMana(playerRace)), min = 1, max = 1 },							

					--сферы200
					{ id = orb200RespZ[7], min = 1, max = 1 },	

					-- 300-375 Item.Weapon, Item.Armor, Item.TravelItem -- 3+2+7		
					-- Амулет Кракена (Артефакт) / Рунный камень (Артефакт) / Цепи жертвенности (Артефакт) / Гномьи наручи (Артефакт) / Цеп Хана (Артефакт)			
					-- Легкие сапоги / Литейные сапоги / Укрепленные сапоги | Гномьи сапоги / Сапоги ветров / Сапоги жизни / Сапоги каменщика
					---{ id = rnd('g001ig0048','g000ig2001','g001ig0611','g000ig3001','g001ig0100','g001ig0110','g001ig0105','g001ig0113', rnd('g001ig0108','g001ig0107','g001ig0109','g001ig0106')), min = 1, max = 1 },
					
					-- Арты300 / Арты300 / Сапоги300
					{id = rnd(artRespZ0[4],artRespZ0[4],bootRespZ0[2]), min = 1, max = 1},
					
				}
			}
		}
	}
	}
end

-- Город т2
local tierTowerResp = 2

function zoneTownsResp(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerResp,
		gapMask = 15,
		stack = {
				subraceTypes = rsub(),
			value = { min = gmm(400,450)*kef, max = gmm(420,470)*kef },
			loot = {
				items = {
					{ id = 'g000ig0001', min = gmm(1,2), max = gmm(1,2) }, --рес
					{ id = 'g000ig0006', min = gmm(1,2), max = gmm(1,2) }, --хил100
					{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
					gmm({ id = 'g000ig7002', min = 1, max = 1 },{ id = 'g000ig7005', min = 1, max = 1 }), --кольцо100/изумруд150
					{ id = w15(), min = 1, max = 1 }, --вард15
					{ id = e2(), min = 1, max = 1 }, --эл200
					{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15

					{ id = rnd(pw4[5],ExtraSecondMana(playerRace)), min = 1, max = 1 }, -- пермо-вард-эффект-дот / второй шар манны

					--сферы400-699
					{ id = orb400RespZ[10], min = 1, max = 1 },					

					-- релики500 / релики500 / релики500 / арты400-500 / арты400-500 / сапоги300
					{ id = rnd(relRespZ[4],relRespZ[4],relRespZ[4],artRespZ[4],artRespZ[4],bootRespZ[3]), min = 1, max = 1 }, 
					
				}
			}
		}
	}
	}
end


-- Город т3
local tierTowerZone = 3

function zoneTownsZone34(playerRace)
	return {
	{
		race = playerRace,
		tier = tierTowerZone,
		gapMask = 15,
		stack = {
			subraceTypes = NoUndead(),
			value = { min = gmm(780,850)*kef, max = gmm(820,890)*kef },
			loot = {
				items = {
					{ id = 'g000ig0001', min = gmm(1,2), max = gmm(1,2) }, --рес
					{ id = 'g000ig0006', min = gmm(2,3), max = gmm(2,3) }, --хил100
					{ id = gmm('g000ig7003','g000ig7004'), min = 1, max = 1 }, --изумруд150/золотое кольцо200
					{ id = e4(), min = 1, max = 1 }, --эл400
					{ id = e2(), min = 1, max = 1 }, --эл200
					{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15

					 -- пермо-вард-стихия / шар родной манны
					{ id = rnd(pw6[3],ExtraHomeMana(playerRace)), min = 1, max = 1 },
					
					--сферы700-799
					{ id = orbZone34[5], min = 1, max = 1 },
					
					-- арты700-1000 / арты700-1000 / релики600-800 / знамёна501-799
					{id = rnd(artResp1[9],artResp1[9],relResp1[8],flagResp1[8]), min = 1, max = 1},
				
				}

			}
		}
	},
	}
end

-- Город т4
function zoneTownsZone5()
	return {
	{
		tier = 1,
		gapMask = 15,
		stack = {
			subraceTypes = {Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralWater, Subrace.NeutralBarbarian, Subrace.NeutralWolf}, -- Subrace.Undead, убрал
			leaderIds = rnd(goldr24,goldr34),
			value = { min = 1705*kef, max = 1790*kef }, -- было 1550*10%
			loot = {
				items = {
					{ id = 'g000ig0001', min = 2, max = 2 },
					{ id = 'g000ig0006', min = gmm(1,2), max = gmm(1,2) }, --хил100
					{ id = 'g000ig0018', min = 1, max = 1 }, -- хил200
					{ id = gmm('g000ig7004','g000ig7005'), min = 1, max = 1 }, -- золотое кольцо200||рубин250
					
					--знамёна801-999
					{ id = rndx(flagZone34), min = 1, max = 1 },
					
					{ id = e4(), min = 1, max = 1 }, --эл400
					{ id = b30(), min = 1, max = 1 }, --банка30
					{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15

					{ id = rnd('g001ig0486',rndy(pw8)), min = 1, max = 1 }, --  шар колдовства / пермо-вард-спец
					
					-- сферы800+
					{ id = orbZone5[5], min = 1, max = 1 },
				}
			}
		}
	}
	}
end


----------------------

-- Руины т0

function zoneRuinRespZ0()
local valueRuinRespZ0 = { min = 170*kef, max = 180*kef }
return {
	{
		gold = { min = kotovasiaGold(gmm(200,300)), max = kotovasiaGold(gmm(220,350))},
		loot = {
			items = {
				{id = relRespZ0[3], min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(220,350)), max = kotovasiaGold(gmm(240,385))},
		loot = {
			items = {
				{id = artRespZ0[3], min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(200,300)), max = kotovasiaGold(gmm(220,350))},
		loot = {
			items = {
				{id = p05[3], min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = valueRuinRespZ0
		}
	},
}
end

-- Руины т1

function zoneRuinRespZ()
return {
	{
		gold = { min = kotovasiaGold(gmm(250,400)), max = kotovasiaGold(gmm(275,450))},
		loot = {
			items = {
				{id = rnd(artRespZ[3],relRespZ[3]), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(240,260)*kef, max = gmm(250,274)*kef }
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(250,400)), max = kotovasiaGold(gmm(275,450))},
		loot = {
			items = {
				{id = rnd(flagRespZ[3],flagRespZ[3],flagRespZ[3],bootRespZ[2]), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(240,260)*kef, max = gmm(250,274)*kef }
		}
	},
}
end


-- Руины т2

function zoneRuinResp()
return {
	{
		gold = { min = kotovasiaGold(gmm(300,500)), max = kotovasiaGold(gmm(330,550))},
		loot = {
			items = {
				--рел/рел/знамя/арт
				{id = rnd(relResp1[7],relResp1[7],flagResp1[7],artResp1[7]), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(420,450)*kef, max = gmm(440,473)*kef }
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(300,500)), max = kotovasiaGold(gmm(330,550))},
		loot = {
			items = {
				--арт/арт/арт/сапоги
				{id = rnd(artResp1[8],artResp1[8],artResp1[8],bootResp1[3]), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = rsub(),
			value = { min = gmm(420,450)*kef, max = gmm(440,473)*kef }
		}
	}
}
end

-- Руины т3

function zoneRuinZone34()
return {
	{
		gold = { min = kotovasiaGold(gmm(350,550)), max = kotovasiaGold(gmm(385,600))},
		loot = {
			items = {
				-- Длани ангела (Реликвия) / Кафтан первооткрывателя (Реликвия) / Роба убийцы (Реликвия) / Тисовый лук (Реликвия) / Шкатулка предсказаний (Реликвия) / Шлем воителя (Реликвия) /
				-- / Проклятый пепел (Артефакт) / Топор палача (Артефакт) / Клинок Возвышенного (Артефакт) / Кольцо небесной воли (Артефакт) / Перстень песков (Артефакт) / Осадный щит (Артефакт)
				-- Чаша жатвы (Артефакт) / Череп шамана (Артефакт) / Щит отражения (Артефакт) / Эльфийская брошь (Артефакт)
				-- {id = rnd('g001ig0424','g001ig0425','g001ig0430','g001ig0539','g001ig0156','g001ig0419','g001ig0197','g001ig0657','g001ig0124','g001ig0612','g001ig0040','g001ig0603','g001ig0041','g001ig0591','g001ig0071','g002ig0019'), min = 1, max = 1},
				
				--арты1000-1450 / арты1000-1450 / арты1000-1450 / сапоги1000
				{id = rnd(artZone34[4],artZone34[4],artZone34[4],bootZone34[2]), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(840,900)*kef, max = gmm(880,945)*kef }
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(385,600)), max = kotovasiaGold(gmm(420,660))},
		loot = {
			items = {
			
				--знамёна700-1300 / знамёна700-1300 / знамёна700-1300 / релики900-1500
				{id = rnd(flagZone34[4],flagZone34[4],flagZone34[4],relZone34[4]), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = { min = gmm(840,900)*kef, max = gmm(880,945)*kef }
		}
	},

}
end

-- Руины т4

function zoneRuinZone5()
local valueRuinZone5 = { min = 1680*kef, max = 1760*kef }
return {
	{
		gold = { min = kotovasiaGold(gmm(420,650)), max = kotovasiaGold(gmm(460,710))},
		loot = {
			items = {
				-- арт
				{id = artZone5[4], min = 1, max = 1},
			}, 
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(420,650)), max = kotovasiaGold(gmm(460,710))},
		loot = {
			items = {
				-- релик / релик / релик / сапоги1100-1300 
				{id = rnd(relZone5[4],relZone5[4],relZone5[4],bootZone5[2]), min = 1, max = 1},
			},

		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(420,650)), max = kotovasiaGold(gmm(460,710))},
		loot = {
			items = {
				-- пермобанка15
				{ id = rnd('g001ig0312','g001ig0310','g001ig0314','g001ig0356'), min = 1, max = 1}, -- Эликсир предвиденья 15точность, Эликсир опережения 15ини, Эликсир наследия 15урон, Зелье вознесения вард-урон
			},
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(420,650)), max = kotovasiaGold(gmm(460,710))},
		loot = {
			items = {
				-- знамёна1200+
				{ id = flagZone5[4], min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = NoUndead(),
			value = valueRuinZone5
		}
	},
}
end

-- Руины тренера

function zoneRuinTrainersCross()
local valueRuinZoneTrainers = { min = 1900*kef, max = 2000*kef }
local valueRuinZoneTrainers2 = { min = 1500*kef, max = 1600*kef }
return {

	{
		gold = { min = kotovasiaGold(gmm(500,800)), max = kotovasiaGold(gmm(550,880))},
		loot = {
			items = {
				{id = ruinTrainers(), min = 1, max = 1},
			},
		},
		guard = {
			--subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers,
		}
	},
	{
		gold = { min = kotovasiaGold(gmm(500,800)), max = kotovasiaGold(gmm(550,880))},
		loot = {
			items = {
				{id = ruinTrainers2(), min = 1, max = 1},
			},
		},
		guard = {
			subraceTypes = NoUndeadDragon(),
			value = valueRuinZoneTrainers2,
			leaderIds = leaderRuinZoneTrainers,
		}
	},
}
end

-----------------------
-- Обменник т2
function rMarketsZone2()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 3
				local k2 = 1
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.Gold, k1, k2 }
					}
				},
			}
		end
]],


    stock = {
		{resource = Resource.Gold, value = { min = 1000, max = 1000 }},
		{resource = Resource.LifeMana, value = { min = 300, max = 300 }},
		{resource = Resource.DeathMana, value = { min = 300, max = 300 }},
		{resource = Resource.InfernalMana, value = { min = 300, max = 300 }},
        {resource = Resource.RunicMana, value = { min = 300, max = 300 }},
        {resource = Resource.GroveMana, value = { min = 300, max = 300 }}
    },
		guard = gmm({}, guard2r()),
}
}
end

-- Обменник центр
function rMarketsZone5()
return {
{
	exchangeRates = [[
		function getExchangeRates(visitor)
				local k1 = 3
				local k2 = 1
			return {
				{
					Resource.Gold,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.LifeMana,
					{
					{ Resource.Gold, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.DeathMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.RunicMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.InfernalMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.Gold, k1, k2 },
					{ Resource.GroveMana, k1, k2 }
					}
				},
				{
					Resource.GroveMana,
					{
					{ Resource.LifeMana, k1, k2 },
					{ Resource.DeathMana, k1, k2 },
					{ Resource.RunicMana, k1, k2 },
					{ Resource.InfernalMana, k1, k2 },
					{ Resource.Gold, k1, k2 }
					}
				},
			}
		end
]],


    stock = {
		{resource = Resource.Gold, value = { min = 1000, max = 1000 }},
		{resource = Resource.LifeMana, value = { min = 300, max = 300 }},
		{resource = Resource.DeathMana, value = { min = 300, max = 300 }},
		{resource = Resource.InfernalMana, value = { min = 300, max = 300 }},
        {resource = Resource.RunicMana, value = { min = 300, max = 300 }},
        {resource = Resource.GroveMana, value = { min = 300, max = 300 }}
    },
		guard = gmm({}, guard4r()),
},
}
end



---------------------

-- Источники Респ - голда + родная
function getMinesRespZ(race)
	local mines = {
		gold = 1,
	}
	if race == Race.Human then
		mines.lifeMana = 1
	elseif race == Race.Dwarf then
		mines.runicMana = 1
	elseif race == Race.Undead then
		mines.deathMana = 1
	elseif race == Race.Heretic then
		mines.infernalMana = 1
	elseif race == Race.Elf then
		mines.groveMana = 1
	end

	return applyKotovasiaMines(mines, true)
end

-- Источники т1: голда, вторая, третья/четвёртая
function getMinesRespZ2(race)
    local mines

    if race == Race.Human then
        mines = {gold = 1, runicMana = 1, groveMana = tbl[1], infernalMana = tbl[2]}
    elseif race == Race.Dwarf then
        mines = {gold = 1, lifeMana = 1, groveMana = tbl[1], deathMana = tbl[2]}
    elseif race == Race.Heretic then
        mines = {gold = 1, deathMana = 1, groveMana = tbl[1], runicMana = tbl[2]}
    elseif race == Race.Undead then
        mines = {gold = 1, infernalMana = 1, runicMana = tbl[1], groveMana = tbl[2]}
    elseif race == Race.Elf then
        mines = {gold = 1, lifeMana = 1, infernalMana = tbl[1], runicMana = tbl[2]}
    end

    return applyKotovasiaMines(mines, false)
end

-- Источники т2: голда, родная, вторая, третья/четвёртая (инверс т1), пятая
function getMinesResp(race)
    local mines

    if race == Race.Human then
        mines = {gold = 1, lifeMana = 1, runicMana = 1, groveMana = tbl[2], infernalMana = tbl[1], deathMana = 1}
    elseif race == Race.Dwarf then
        mines = {gold = 1, runicMana = 1, lifeMana = 1, groveMana = tbl[2], deathMana = tbl[1], infernalMana = 1}
    elseif race == Race.Heretic then
        mines = {gold = 1, infernalMana = 1, deathMana = 1, groveMana = tbl[2], runicMana = tbl[1], lifeMana = 1}
    elseif race == Race.Undead then
        mines = {gold = 1, deathMana = 1, infernalMana = 1, runicMana = tbl[2], groveMana = tbl[1], lifeMana = 1}
    elseif race == Race.Elf then
        mines = {gold = 1, groveMana = 1, lifeMana = 1, infernalMana = tbl[2], runicMana = tbl[1], deathMana = 1}
    end

    return applyKotovasiaMines(mines, false)
end

-- Источники т3: голда, родная, третья/четвёртая, пятая
function getMinesZone34(race)
    local mines

    if race == Race.Human then
        mines = {gold = 1, lifeMana = 1, groveMana = tbl[1], infernalMana = tbl[2], deathMana = 1}
    elseif race == Race.Dwarf then
        mines = {gold = 1, runicMana = 1, groveMana = tbl[1], deathMana = tbl[2], infernalMana = 1}
    elseif race == Race.Heretic then
        mines = {gold = 1, infernalMana = 1, groveMana = tbl[1], runicMana = tbl[2], lifeMana = 1}
    elseif race == Race.Undead then
        mines = {gold = 1, deathMana = 1, runicMana = tbl[1], groveMana = tbl[2], lifeMana = 1}
    elseif race == Race.Elf then
        mines = {gold = 1, groveMana = 1, infernalMana = tbl[1], runicMana = tbl[2], deathMana = 1}
    end

    return applyKotovasiaMines(mines, false)
end

-- Источники т4: голда, два родные рас, рандомный (не родной рас)
function getMinesZone5(race, race2)
    local mines
    local tblmid = {1,0,0}

    for i = #tblmid, 2, -1 do
        local j = math.random(i)
        tblmid[i], tblmid[j] = tblmid[j], tblmid[i]
    end

    if race == Race.Human and race2 == Race.Dwarf or race == Race.Dwarf and race2 == Race.Human then
        mines = {gold = 1, lifeMana = 1, runicMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Human and race2 == Race.Undead or race == Race.Undead and race2 == Race.Human then
        mines = {gold = 1, lifeMana = 1, deathMana = 1, runicMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Human and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Human then
        mines = {gold = 1, lifeMana = 1, infernalMana = 1, deathMana = tblmid[1], runicMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Human and race2 == Race.Elf or race == Race.Elf and race2 == Race.Human then
        mines = {gold = 1, lifeMana = 1, groveMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], runicMana = tblmid[3]}

    elseif race == Race.Dwarf and race2 == Race.Undead or race == Race.Undead and race2 == Race.Dwarf then
        mines = {gold = 1, runicMana = 1, deathMana = 1, lifeMana = tblmid[1], infernalMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Dwarf and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Dwarf then
        mines = {gold = 1, runicMana = 1, infernalMana = 1, deathMana = tblmid[1], lifeMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Dwarf and race2 == Race.Elf or race == Race.Elf and race2 == Race.Dwarf then
        mines = {gold = 1, runicMana = 1, groveMana = 1, deathMana = tblmid[1], infernalMana = tblmid[2], lifeMana = tblmid[3]}

    elseif race == Race.Undead and race2 == Race.Heretic or race == Race.Heretic and race2 == Race.Undead then
        mines = {gold = 1, deathMana = 1, infernalMana = 1, lifeMana = tblmid[1], runicMana = tblmid[2], groveMana = tblmid[3]}

    elseif race == Race.Undead and race2 == Race.Elf or race == Race.Elf and race2 == Race.Undead then
        mines = {gold = 1, deathMana = 1, groveMana = 1, lifeMana = tblmid[1], infernalMana = tblmid[2], runicMana = tblmid[3]}

    elseif race == Race.Heretic and race2 == Race.Elf or race == Race.Elf and race2 == Race.Heretic then
        mines = {gold = 1, infernalMana = 1, groveMana = 1, deathMana = tblmid[1], lifeMana = tblmid[2], runicMana = tblmid[3]}
    end

    return applyKotovasiaMines(mines, false)
end

-- Источники зона-тренер: родная, третья/четвёртая (инверс т1)
function getMinesX(race)
	if race == Race.Human then return
		{lifeMana = 1, groveMana = tbl[2], infernalMana = tbl[1]}
	elseif race == Race.Dwarf then return
		{runicMana = 1, groveMana = tbl[2], deathMana = tbl[1]}
	elseif race == Race.Heretic then return
		{infernalMana = 1, groveMana = tbl[2], runicMana = tbl[1]}
	elseif race == Race.Undead then return
		{deathMana = 1, runicMana = tbl[2], groveMana = tbl[1]}
	elseif race == Race.Elf then return
		{groveMana = 1, infernalMana = tbl[2], runicMana = tbl[1]}
	end
end

----------------
--	наёмники начало

-- нейтралы Мили2
function MercM2()
	local radn = math.random(0,11)
	if radn == 0 then
	return 'g003uu5030' -- Агент 220
	elseif radn == 1 then
	return 'g000uu5031' -- Головорез 300
	elseif radn == 2 then
	return 'g001uu7545' -- Сегаш
	elseif radn == 3 then
	return 'g000uu5028' -- Тритон
	elseif radn == 4 then
	return 'g000uu5033' -- Упырь 220
	elseif radn == 5 then
	return 'g000uu7611' -- Страж домн 235
	elseif radn == 6 then
	return 'g000uu5003' -- Копейщик 220
	elseif radn == 7 then
	return 'g000uu5011' -- Кентавр-фалангист 490
	elseif radn == 8 then
	return 'g000uu5005' -- Лесной эльф 220
	elseif radn == 9 then
	return 'g000uu5040' -- Варвар 590
	elseif radn == 10 then
	return 'g000uu5039' -- Волк 220
	elseif radn == 11 then
	return 'g001uu8279' -- Чумной волк 235

	end
end

-- нейтралы Лучники2
function MercA2()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu5007' -- Кентавр 240
	elseif radn == 1 then
	return 'g000uu6103' -- Элементаль Воздуха
	elseif radn == 2 then
	return 'g000uu8171' -- Сущность бури 525
	elseif radn == 3 then
	return 'g000uu8170' -- Сущность пламени
	end
end

-- нейтралы Маги2
function MercMg2()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001uu7553' -- Ведунья 260
	elseif radn == 1 then
	return 'g000uu8201' -- Скальд 175
	elseif radn == 2 then
	return 'g000uu8190' -- Сущность искажения 260
	elseif radn == 3 then
	return 'g000uu8169' -- Каменная сущность 525
	elseif radn == 4 then
	return 'g000uu8168' -- Ледяная сущность 525
	elseif radn == 5 then
	return 'g000uu8246' -- Чародей 400
	elseif radn == 6 then
	return 'g000uu8157' -- Гоблин-громыхун 400
	end
end

-- нейтралы Поддержка2
function MercH2()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu2006' -- Наяда
	elseif radn == 1 then
	return 'g000uu6113' -- Оккультист 260
	elseif radn == 2 then
	return 'g001uu7614' -- Искатель рун
	end
end

---
-- нейтралы Мили3
function MercM3()
	local radn = math.random(0,10)
	if radn == 0 then
	return 'g000uu6121' -- Дхампир 1070
	elseif radn == 1 then
	return 'g000uu7608' -- Каменщик
	elseif radn == 2 then
	return 'g000uu8306' -- Экзекутор 525
	elseif radn == 3 then
	return 'g000uu7588' -- Отлученный 725
	elseif radn == 4 then
	return 'g000uu8247' -- Разоритель 725
	elseif radn == 5 then
	return 'g000uu8041' -- Темный Эльф Мясник
	elseif radn == 6 then
	return 'g000uu8151' -- Фурия
	elseif radn == 7 then
	return 'g003uu5031' -- Гонитель Ереси 755
	elseif radn == 8 then
	return 'g000uu8276' -- Последователь 725
	elseif radn == 9 then
	return 'g000uu7607' -- Черный ядозуб 825
	elseif radn == 10 then
	return 'g000uu9009' -- Сущность волны 1000
	end
end

-- нейтралы Лучники3
function MercA3()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001uu7612' -- Королевский арбалетчик 490
	elseif radn == 1 then
	return 'g000uu8274' -- Медуза-охотница 700
	elseif radn == 2 then
	return 'g000uu8042' -- Темный Эльф Потрошитель 625
	elseif radn == 3 then
	return 'g001uu7617' -- Тень культа 1070
	elseif radn == 4 then
	return 'g000uu8045' -- Траппер 1070
	elseif radn == 5 then
	return 'g001uu8282' -- Тенистый паук
	elseif radn == 6 then
	return 'g000uu7590' -- Ящер-охотник 590
	end
end

-- нейтралы Маги3
function MercMg3()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8046' -- Шаманка 990
	elseif radn == 1 then
	return 'g000uu8048' -- Старейшина Гоблинов 570
	elseif radn == 2 then
	return 'g000uu8043' -- Жрица Безмясой 900
	end
end

-- нейтралы Поддержка3
function MercH3()
	local radn = math.random(0,1)
	if radn == 0 then
	return 'g000uu8213' -- Гоблин-шаман
	elseif radn == 1 then
	return 'g000uu7619' -- Слуга культа
	end
end

---
-- нейтралы Мили4
function MercM4()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001uu7560' -- Каратель 1230
	elseif radn == 1 then
	return 'g000uu6106' -- Принцесса гномов 1200
	elseif radn == 2 then
	return 'g000uu5032' -- Вождь варваров 1400
	elseif radn == 3 then
	return 'g001uu7613' -- Огнеборец 1700
	elseif radn == 4 then
	return 'g003uu0023' -- Предатель
	elseif radn == 5 then
	return 'g000uu6108' -- Барон 1940
	end
end

-- нейтралы Лучники4
function MercA4()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu8174' -- Вестник распада
	elseif radn == 1 then
	return 'g000uu7566' -- Первородная сущность 1800
	elseif radn == 2 then
	return 'g000uu7567' -- Первородная сущность
	elseif radn == 3 then
	return 'g000uu8237' -- Первородная сущность
	end
end

-- нейтралы Маги4
function MercMg4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8005' -- Дух волка 990
	elseif radn == 1 then
	return 'g000uu8275' -- Медуза
	elseif radn == 2 then
	return 'g001uu7624' -- Неприкаянная 1900
	end
end

-- нейтралы Поддержка4
function MercH4()
	local radn = math.random(0,2)
	if radn == 0 then
	return 'g000uu8035' -- Вильсида 1620
	elseif radn == 1 then
	return 'g000uu8218' -- Волхв 1750
	elseif radn == 2 then
	return 'g000uu7544' -- Настоятельница
	end
end

-- нейтралы Рандомные5
function MercR5()
	return rnd(
	-- мили
	'g001uu7600', -- Длань инквизиции 3400
	'g000uu8153', -- Жнец 4100
	'g000uu6117', -- Костяной лорд 3250
	'g000uu8244', -- Отступник 3250
	'g000uu5014', -- Хан орков 3000
	'g000uu8231', -- Катафрактарий 4700
	'g000uu8278', -- Божественная Длань 3400
	-- ренж
	'g001uu8257', -- Громовержец 3950
	'g001uu7625', -- Темный оракул 3700
	'g001uu8255', -- Эльф-тень 3200
	'g006uu1026', -- Жрец Смерти 3250
	'g001uu8260', -- Искуситель 3450
	'g000uu8304', -- Ангел разорения 4200
	'g000uu8305' -- Предвестница Смерти 5050
	)
end

-- нейтралы Велики1
function MercB1()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000uu5038' -- Бурый медведь 285
	elseif radn == 1 then
	return 'g000uu5037' -- Белый медведь 490
	elseif radn == 2 then
	return 'g000uu8189' -- Сущность искажения 500
	elseif radn == 3 then
	return 'g001uu8309' -- Триббог 625
	end
end

-- нейтралы Велики2
function MercB2()
	local radn = math.random(0,8)
	if radn == 0 then
	return 'g001uu8281' -- Горный ткач 1350
	elseif radn == 1 then
	return 'g000uu8160' -- Каменная сущность 1150
	elseif radn == 2 then
	return 'g001uu7551' -- Ларней 1090
	elseif radn == 3 then
	return 'g000uu8159' -- Ледяная сущность 1150
	elseif radn == 4 then
	return 'g000uu5015' -- Людоед 1090
	elseif radn == 5 then
	return 'g001uu8271' -- Огр 1250
	elseif radn == 6 then
	return 'g000uu8158' -- Сущность бури 1150
	elseif radn == 7 then
	return 'g000uu8161' -- Сущность пламени 1150
	elseif radn == 8 then
	return 'g000uu5035' -- Черный паук 1350
	end
end

-- нейтралы Велики3
function MercB3()
	local radn = math.random(0,7)
	if radn == 0 then
	return 'g001uu0025' -- Голем 2000
	elseif radn == 1 then
	return 'g001uu7554' -- Йорм 1300
	elseif radn == 2 then
	return 'g001uu7597' -- Кадавр 1850
	elseif radn == 3 then
	return 'g000uu5027' -- Кракен 1850
	elseif radn == 4 then
	return 'g001uu7586' -- Легат 1480
	elseif radn == 5 then
	return 'g001uu7620' -- Одержимый великан 1560
	elseif radn == 6 then
	return 'g001uu8280' -- Пещерный паук 1450
	elseif radn == 7 then
	return 'g000uu5016' -- Тролль 2100
	end
end

-- нейтралы Велики4
function MercB4()
	local radn = math.random(0,6)
	if radn == 0 then
	return 'g001uu0051' -- Каменный предок 3500
	elseif radn == 1 then
	return 'g000uu5029' -- Морской змей 3500
	elseif radn == 2 then
	return 'g000uu5010' -- Облачная Погибель 2370
	elseif radn == 3 then
	return 'g005uu6111' -- Пожиратель 2600
	elseif radn == 4 then
	return 'g001uu7548' -- Черный тролль 2250
	elseif radn == 5 then
	return 'g001uu0104' -- Танатос 3500
	elseif radn == 6 then
	return 'g000uu8209' -- Гибельный рой 2500
	end
end

---
-- Юниты для наёмников (зона т1)
function unitsMercenX(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = 'g000uu0006', level = 1, unique = false } i = i + 1 -- Лучник
unitsm[i] = { id = 'g000uu0011', level = 1, unique = false } i = i + 1 -- Послушница
unitsm[i] = { id = 'g000uu0008', level = 1, unique = false } i = i + 1 -- Ученик
unitsm[i] = { id = 'g000uu7628', level = 1, unique = true } i = i + 1 -- Имперский гвардеец
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = 'g004uu5039', level = 1, unique = false } i = i + 1 -- Снежный волк
unitsm[i] = { id = 'g000uu0026', level = 1, unique = false } i = i + 1 -- Метатель топоров
unitsm[i] = { id = 'g000uu0033', level = 1, unique = false } i = i + 1 -- Травница
unitsm[i] = { id = 'g000uu7627', level = 1, unique = true } i = i + 1 -- Советник Витара
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = 'g001uu7539','g000uu0086', level = 1, unique = false } i = i + 1 -- Колотун / Мертвец
unitsm[i] = { id = 'g000uu0080', level = 1, unique = false } i = i + 1 -- Адепт
unitsm[i] = { id = 'g000uu0078', level = 1, unique = false } i = i + 1 -- Привидение
unitsm[i] = { id = 'g001uu7592', level = 1, unique = true } i = i + 1 -- Торхот
unitsm[i] = { id = 'g000uu0092', level = 1, unique = true } i = i + 1 -- Оборотень
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
unitsm[i] = { id = 'g000uu0055', level = 1, unique = true } i = i + 1 -- Горгулья
unitsm[i] = { id = 'g000uu0057', level = 1, unique = true } i = i + 1 -- Черт
unitsm[i] = { id = 'g000uu7605', level = 1, unique = true } i = i + 1 -- Скульптор лжи
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0069', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = 'g000uu8018', level = 1, unique = false } i = i + 1 -- Разведчик
unitsm[i] = { id = 'g000uu8025', level = 1, unique = false } i = i + 1 -- Послушник леса
unitsm[i] = { id = 'g000uu8031', level = 1, unique = false } i = i + 1 -- Дух
unitsm[i] = { id = 'g000uu7629', level = 1, unique = true } i = i + 1 -- Благородный эльф
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

-- рандомный нейтрал т3
unitsm[i] = { id = rnd(MercM3(), MercM3(), MercA3(), MercMg3(), MercH3()), level = 1, unique = true } i = i + 1 -- мили / мили / лучник / маг / потдержка


return unitsm
end


-- Наёмники т1
function zoneMercenZoneX(race)
return {
	{
		units = unitsMercenX(race),
	}
}
end


-- Юниты для наёмников зоны 2 (начальные)
function unitsMercen12(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
unitsm[i] = { id = rnd('g000uu0006','g000uu0011','g000uu0008'), level = 1, unique = false } i = i + 1 -- Лучник / Послушница / Ученик
-- Алебардист / Оруженосец / Охотник на ведьм / Поборник / Рыцарь // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g003uu5002','g000uu2014','g000uu0004','g000uu2029','g000uu0002'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Егерь / Рейнджер / Саггитар // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7561','g000uu0007','g000uu8310'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Волшебник // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0009', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Жрец / Монахиня // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0012','g000uu0016'), level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Титан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0018', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
unitsm[i] = { id = rnd('g000uu0026','g000uu0033'), level = 1, unique = false } i = i + 1 -- Метатель топоров / Травница
-- Воин // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0037', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Арбалетчик // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0027', level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
--  // Маги2
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
-- Посвященная // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0034', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Йети / Холмовой великан // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0043','g000uu0029'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
unitsm[i] = { id = rnd('g000uu0080','g000uu0078'), level = 1, unique = false } i = i + 1 -- Адепт / Привидение
-- Зомби / Тамплиер / Череполом // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0087','g000uu0090','g003uu5013'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- / Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Колдун / Чумотворец // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0081','g000uu7542'), level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Призрак // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0079', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Виверна // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0093', level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
unitsm[i] = { id = 'g000uu0062', level = 1, unique = false } i = i + 1 -- Сектант
-- Берсеркер // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0053', level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- // Лучники2
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
-- Темный колдун // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0063', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Ведьма // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0067', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6101', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Горгулья / Черт / Манкуб // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0055','g000uu0057','g000uu0069'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
unitsm[i] = { id = rnd('g000uu8018','g000uu8025','g000uu8031'), level = 1, unique = false } i = i + 1 -- Разведчик / Послушник леса / Дух
-- Кентавр-латник / Кентавр-странник // Мили2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8015','g000uu8016'), level = 2, unique = true } else unitsm[i] = { id = MercM2(), level = 1, unique = true } end i = i + 1
-- Охотник / Сторож // Лучники2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8019','g000uu8022'), level = 2, unique = true } else unitsm[i] = { id = MercA2(), level = 1, unique = true } end i = i + 1
-- Чанелер // Маги2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8026', level = 2, unique = true } else unitsm[i] = { id = MercMg2(), level = 1, unique = true } end i = i + 1
-- Оракул // Поддержка2
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8032', level = 2, unique = true } else unitsm[i] = { id = MercH2(), level = 1, unique = true } end i = i + 1
--
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
-- Грифон / Священное древо // Велики1
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8029','g003uu8037'), level = 1, unique = true } else unitsm[i] = { id = MercB1(), level = 1, unique = true } end i = i + 1

end

-- рандомный нейтрал т4
unitsm[i] = { id = rnd(MercM4(), MercA4(), MercMg4()), level = 1, unique = true } i = i + 1 -- мили / лучник / маг -- БЕЗ потдержки

return unitsm
end

-- Наёмники в зоне 2
function zoneMercenZone12(race)
return {
	{
		units = unitsMercen12(race),
		guard = gmm({}, guard2n()),
		}
	}
end


-- Юниты для наёмников зоны 3 (основные)
function unitsMercen(race)
local unitsm = {}
local i = 1

if race == Race.Human then
unitsm[i] = { id = rnd('g000uu0001','g003uu5001'), level = 1, unique = false } i = i + 1 -- Сквайр / Боец ополчения
-- Детектив / Имперский рыцарь / Инквизитор / Клинок в тени / Ревнитель / Страж Святости // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2030','g000uu0003','g000uu0005','g000uu2009','g003uu5003','g000uu2015'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Ардет / Ассасин / Бореалис // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8311','g000uu0154','g000uu7562'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Заклинатель / Маг / Ученик-элементалист // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7581','g000uu0010','g000uu0153'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Аббатиса / Иерей / Священник // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0017','g000uu7569','g000uu0013'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Ангел / Бич ереси / Великий инквизитор / Защитник веры / Защитник угнетенных / Кара Императора / Сенешаль / Эмиссар // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0014','g000uu2016','g000uu0157','g000uu0015','g003uu6108','g000uu2010','g001uu7543','g000uu2031'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Игнар / Юстициар // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu8312','g000uu9000'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Белый маг / Криомант / Магистр стихий // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0152','g001uu7582','g000uu8185'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Епископ / Патриарх / Прорицательница // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu7570','g000uu0150','g000uu0151'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Рефаим // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu7595', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Dwarf then
unitsm[i] = { id = 'g000uu0036', level = 1, unique = false } i = i + 1 -- Гном
-- Белый волк / Ветеран // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7571', level = 2, unique = true },{ id = 'g000uu0038', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Гарм / Защитник горна / Сотрясатель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu8005', level = 2, unique = true },{ id = 'g000uu0162', level = 3, unique = true },{ id = 'g000uu7568', level = 3, unique = true }) else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Горец / Мастер печи // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0041','g006uu1128'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Алхимик / Друид / Исса // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0161','g000uu0035','g000uu7558'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Старый ветеран / Хранитель рун // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0040','g000uu2011'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
--  // Лучники4
unitsm[i] = { id = MercA4(), level = 1, unique = true } i = i + 1
-- Метатель огня / Отшельник / Повелитель волков // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu2020','g000uu0163','g000uu0164'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Архидруид / Хэйсса / Эйра // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0160','g000uu7559','g000uu7557'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Горный великан / Йамму // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0030','g000uu7583'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Undead then
unitsm[i] = { id = rnd('g000uu0086','g001uu7539'), level = 1, unique = false } i = i + 1 -- Мертвец / Колотун
-- Волколак / Хорт / Чумной оборотень / Лорд Тьмы / Орк-палач / Скелет-воин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g001uu7563', level = 2, unique = true },{ id = 'g001uu7564', level = 2, unique = true },{ id = 'g001uu7565', level = 2, unique = true },{ id = 'g000uu0091', level = 3, unique = true },{ id = 'g003uu5012', level = 3, unique = true },{ id = 'g000uu0088', level = 3, unique = true }) else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Злой дух // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0085', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Некромант / Теневидец // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0082','g001uu7598'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Мумификатор / Тень / Эльф-призрак // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu2007','g000uu0174','g001uu8267'), level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Каган Каменной Пасти / Клеврет Смерти / Скелет-рыцарь / Хан Каменной Пасти // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7540','g001uu8314','g000uu0089','g003uu5014'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Смерть / Сущий // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0177','g000uu0178'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Вампир / Лич // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0083','g000uu0084'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Длань Мортис // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu2008', level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Дракон Рока // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0094', level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1

---

elseif race == Race.Heretic then
unitsm[i] = { id = 'g000uu0052', level = 1, unique = false } i = i + 1 -- Одержимый
-- Черный паладин // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu0054', level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Мучитель // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2003', level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Дьяволенок / Демонолог / Подражатель // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = rnd({ id = 'g004uu6101', level = 2, unique = true },{ id = rnd('g000uu0064','g000uu0171'), level = 3, unique = true }) else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Колдунья // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu0068', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Возвышенный / Искоренитель // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0166','g000uu8254'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Истязатель душ // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu2004', level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Пандемониус / Хозяин масок // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu0066','g001uu8242'), level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Суккуб / Инкуб // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu0173','g000uu0065'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Апатитовая горгулья / Демон / Мраморная горгулья / Сатир // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7572','g000uu0058','g000uu0056','g000uu7577'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
---

elseif race == Race.Elf then
unitsm[i] = { id = 'g000uu8014', level = 1, unique = false } i = i + 1 -- Кентавр-копейщик
-- Кентавр-гвардеец / Кентавр-дикарь /  // Мили3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g001uu7579','g000uu8017'), level = 3, unique = true } else unitsm[i] = { id = MercM3(), level = 1, unique = true } end i = i + 1
-- Бандит / Кентавр Стрелок / Стингер / Стражник / Часовой // Лучники3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8021','g000uu2012','g000uu8020','g000uu8023','g000uu8024'), level = 3, unique = true } else unitsm[i] = { id = MercA3(), level = 1, unique = true } end i = i + 1
-- Архонт / Дентрофонт / Тиург // Маги3
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8027','g000uu8227','g000uu8028'), level = 3, unique = true } else unitsm[i] = { id = MercMg3(), level = 1, unique = true } end i = i + 1
-- Лесная Дева // Поддержка3
if math.random(0,3) ~= 1 then unitsm[i] = { id = 'g000uu8033', level = 3, unique = true } else unitsm[i] = { id = MercH3(), level = 1, unique = true } end i = i + 1
--
-- Кераст / Налетчик /  // Мили4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu7578','g000uu2013'), level = 4, unique = true } else unitsm[i] = { id = MercM4(), level = 1, unique = true } end i = i + 1
-- Разбойник / Штормовой кентавр // Лучники4
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8051','g001uu8240'), level = 4, unique = true } else unitsm[i] = { id = MercA4(), level = 1, unique = true } end i = i + 1
-- Консул // Маги4
if math.random(0,2) ~= 1 then unitsm[i] = { id = 'g000uu8258', level = 4, unique = true } else unitsm[i] = { id = MercMg4(), level = 1, unique = true } end i = i + 1
-- Дриолисса / Солнечная Танцовщица / Целитель // Поддержка4
-- if math.random(0,3) ~= 1 then unitsm[i] = { id = rnd('g000uu8214','g000uu8034','g000uu2002'), level = 4, unique = true } else unitsm[i] = { id = MercH4(), level = 1, unique = true } end i = i + 1
-- Владыка Небес / Энт-целитель // Велики2
if math.random(0,2) ~= 1 then unitsm[i] = { id = rnd('g000uu8030','g003uu8038'), level = 2, unique = true } else unitsm[i] = { id = MercB2(), level = 1, unique = true } end i = i + 1
end

-- рандомный нейтрал т5 (300-450xp) 3-4k цена
unitsm[i] = { id = MercR5(), level = 1, unique = true } i = i + 1 -- нейтрал т5

return unitsm
end

-- Наёмники в зоне 3
function zoneMercenZone(race)
return {
	{
		units = unitsMercen(race),
		guard = gmm({}, guard3n()),
		}
	}
end

-- Юниты для наёмников зоны 4 (центр)
function unitsMercen4(race, race2)
local unitsm = {}
local i = 1
unitsm[i] = { id = MercM2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercA2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercMg2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercM3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercA3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercMg3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercB2(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercB3(), level = 1, unique = true } i = i + 1
unitsm[i] = { id = MercB4(), level = 1, unique = true } i = i + 1

-- рандомный нейтрал т3
--unitsm[i] = { id = rnd(MercM3(), MercM3(), MercA3(), MercMg3(), MercH3()), level = 1, unique = true } i = i + 1 -- мили / мили / лучник / маг / потдержка

return unitsm
end

-- Наёмники в зоне 4 (центр)
function zoneMercenZone4(race, race2)
return {
	{
		units = unitsMercen4(race, race2),
		guard = gmm({}, guard4n()),
		}
	}
end

----------------------

-- Сундуки тренер
function bagsRespX()
return {
	count = 1,
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
			{ id = b15(), min = 1, max = 1 },
			{ id = torb11[4], min = 1, max = 1 }, -- Сфера 100 в цель
		}
	}
}
end


-- Сундуки Респ
function bagsResp00()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 250 },
		itemValue = { min = 250, max = 250 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = e2(), min = 1, max = 1 }, --эл 200-375			
			{ id = torb11[5], min = 1, max = 1 }, -- Сфера 100 в цель
		}
	}
}
end


-- Сундуки т1
function bagsResp0()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 490, max = 490 },
		itemValue = { min = 250, max = 375 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0180', min = 1, max = 2 }, --1/2трава
			{ id = rnd(e2(),b15()), min = 1, max = 1 },			
			{ id = torb12[4], min = 1, max = 1 }, -- Сфера 100 аое
		}
	}
}
end

-- Сундуки т2
function bagsResp()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 740, max = 740 },
		itemValue = { min = 250, max = 625 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g001ig0180', min = 2, max = 2 }, { id = 'g000ig0005', min = 1, max = 1 }), --2трава/хил50
			{ id = rnd(orb200RespZ[4],rnd('g000ig5043','g000ig5041','g000ig5024','g000ig5007','g000ig5097','g000ig5004','g000ig5062','g000ig5025','g000ig5061','g000ig5098')), min = 1, max = 1 }, -- сфера 200 / свиток "Ignis mare", "Incantare Hellhound", буран, исцеление, кустарник, молния, мор, рух, скелет, энт
			{ id = rnd(w15(),w15(),b15()), min = 1, max = 1 },
		}
	}
}
end

-- Сундуки т3
function bagsZone34()
return {
	count = 1,
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 750, max = 750 },
		itemValue = { min = 375, max = 750 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			orr({ id = 'g001ig0180', min = 3, max = 3 }, { id = 'g001ig0378', min = 1, max = 1 }), --3трава/хил75
			{ id = rnd(orb400RespZ[11],'g000ig5002','g000ig5044','g000ig5021','g001ig0247','g000ig5003','g001ig0250','g000ig5023','g001ig0248','g000ig5045','g000ig5064','g000ig5101','g000ig5106','g000ig5102'), min = 1, max = 1 }, -- свиток быстрота, Menta minoris, л.щит, неудача, сила, с.кости, с.витара, устр. гимн, tormentio-броня, слабость, стая, смятение, ст.рощи
			{ id = e4(), min = 1, max = 1 }, --
		}
	}
}
end

-- Сундуки т4
function bagsZone5(playerRace, playerRace2)
return {
	{
		count = 1,
		loot = {
			items = {
				{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = rnd(rms(),'g000ig7003'), min = 1, max = 1 }, --сл.шар/изумруд
				-- Сфера700-799
				{ id = rnd(rndx(orbZone34),rndx(orbZoneD34)), min = 1, max = 1 }, -- сферы700-799 / сферы700-799 на дамаг 
				--{ id = fbanka(4), min = 1, max = 1 }, -- Зелье завоевателя (желы)
				{ id = e4(), min = 1, max = 1 }, --
			}
		}
	},	
	{
		count = 1,
		loot = {
			items = {
				{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = ExtraHomeMana(playerRace), min = 1, max = 1 }, -- родная мана игрока 1
				-- Свиток "Сокрушение"-броня, "Infernus"-крит, прокл.эмира-урон, спеш.время+ини.урон, могущество+урон, "Chronos"-ини, "Terebrare corde"+точ.урон, "Проклятие Ниграэля"-урон, "Cursa demoneus"-урон
				{ id = rnd('g001ig0252','g001ig0164','g001ig0253','g001ig0255','g001ig0256','g000ig5050','g001ig0254','g000ig5069','g000ig5049'), min = 1, max = 1 },
				{ id = b30(), min = 1, max = 1 },
				
			}
		}
	
	},
	{
		count = 1,
		loot = {
			items = {
				{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
				{ id = ExtraHomeMana(playerRace2), min = 1, max = 1 }, -- родная мана игрока 2
				-- Свиток "Божественная мудрость" +15 опыт / Свиток "Забвение" -свитки-сферы / Свиток "Заступничество" +25%бодигард / Свиток "Искусный торговец" 20% скидки / Свиток "Проведение Всевышнего" +сферы / Свиток "Хождение по лесу" / Свиток "Призыв II: Хуорн" / Свиток "Призыв II: Энт" / Призывает Оживший доспех на 1 ход.
				{ id = rnd('g001ig0193','g002ig0023','g001ig0568','g000ig5085','g001ig0492','g000ig5022','g000ig5066','g000ig5103','g000ig5008'), min = 1, max = 1 },
				{ id = rnd(e4(),b30()), min = 1, max = 1 },
			}
		}
	
	}
}
end

----------------------
-- МОИ ФУНКЦИИ
----------------------

-- Быль или не быть
function yn(what)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return ""
	end
end

-- Или / или
function orr(what, what2)
	local radn = math.random(0,1)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	end
end

-- Или / или 3
function orr3(what, what2, what3)
	local radn = math.random(0,2)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	end
end

-- Или / или 5
function orr5(what, what2, what3, what4, what5)
	local radn = math.random(0,4)
	if radn == 0 then
	return what
	elseif radn == 1 then
	return what2
	elseif radn == 2 then
	return what3
	elseif radn == 3 then
	return what4
	elseif radn == 4 then
	return what5
	end
end

-- случайный
function rnd(...)
    return (select(math.random(select('#', ...)), ...))
end

-- перемешать таблцу
function mix(tblmg)
		for i = #tblmg, 2, -1 do
			local j = math.random(i)
			tblmg[i], tblmg[j] = tblmg[j], tblmg[i]
		end
end

-- перебор всей таблицы
function rndz(tabl,tabl0)
	x = math.random(1, #tabl)
	table.insert(tabl0, tabl[x])
	y = tabl[x]
	table.remove(tabl, x)
	return y
end

-- перебор всей таблицы c удалением (когда записей хватает)
function rndy(tabl)
	local x = math.random(1, #tabl)
	local y = tabl[x]
	table.remove(tabl, x)
	return y
end

-- случайный выбор из тадлицы без удаления
function rndx(tabl)
	local x = math.random(1, #tabl)
	local y = tabl[x]
	return y
end

-- перебор всей таблицы для юнитов ГО в зависимости от банки на перк (когда записей хватает)
function rndynldr(tabl)
	local x = math.random(1, #tabl)
	local y = tabl[x]
	table.remove(tabl, x)
	if y == 'g001ig0528' or y == 'g001ig0526' or y == 'g001ig0525' then
		--nldr = 'Хранитель искусств'
		rldr = {Subrace.Human,Subrace.Dwarf,Subrace.NeutralHuman}
	elseif y == 'g001ig0527' or y == 'g001ig0531' or y == 'g001ig0529' then
		--nldr = 'Хранитель тайн'
		rldr = {Subrace.Heretic,Subrace.Elf,Subrace.NeutralElf,Subrace.NeutralGreenSkin,Subrace.NeutralMarsh,Subrace.NeutralBarbarian,Subrace.NeutralWolf,Subrace.NeutralWater}
	end
	return y
end

-- место банки на жезлы -- не использую!
function fbanka(x)
	if x == banka then
		return 'g001ig0524'
	else
		return e4()
	end
end


---------------

-- Специальный режим карты - минизоны
function smm(vanilla, judge, training)
	if smode == 1 then
		return training
	elseif smode == 2 then
		return judge
	elseif smode == 3 then
		return vanilla
	end
end

-- Режим карты
function gmm(outrun, classic)
	if gmode == 1 then
	return outrun
	elseif gmode == 2 then
	return classic
	end
end

-- Paymobs владелец отряда
function playmobsOwner(playerRaceX)
	if playmobs == 1 then
		return playerRaceX
	end
end

-- Paymobs модификаторы мобов: -100% очков движения, -1*6 обзора
function playmobsModif()
	if playmobs == 1 then
		return {'g200um9034','g201um9037','g201um9037','g201um9037','g201um9037','g201um9037','g201um9037'}
	end
end

-- субраса игрока
function getPlayerSubRace(race)
	if race == Race.Human then return Subrace.Human
	elseif race == Race.Dwarf then return Subrace.Dwarf
	elseif race == Race.Undead then return Subrace.Undead
	elseif race == Race.Heretic then return Subrace.Heretic
	elseif race == Race.Elf then return Subrace.Elf
	end
end

--фракционный лидер
function ldhero(race)
	if race == Race.Human then xldhero = rnd(goldrt4hm)
	elseif race == Race.Dwarf then xldhero = rnd(goldrt4dw)
	elseif race == Race.Undead then xldhero = rnd(goldrt4un)
	elseif race == Race.Heretic then xldhero = rnd(goldrt4hr)
	elseif race == Race.Elf then xldhero = rnd(goldrt4el)
	end
	return xldhero
end

-- родной шар манны
function ExtraHomeMana(race)

	shmn = 'g001ig0146' -- Шар маны Жизни
	sdw = 'g001ig0148' -- Шар маны Рун
	sun = 'g001ig0149' -- Шар маны Смерти
	shr = 'g001ig0147' -- Шар маны Преисподней
	self = 'g001ig0150' -- Шар Лесного эликсира

	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- второй шар манны
function ExtraSecondMana(race)

	shmn = 'g001ig0146' -- Шар маны Жизни
	sdw = 'g001ig0148' -- Шар маны Рун
	sun = 'g001ig0149' -- Шар маны Смерти
	shr = 'g001ig0147' -- Шар маны Преисподней
	self = 'g001ig0150' -- Шар Лесного эликсира

	if race == Race.Human then return sdw
	elseif race == Race.Dwarf then return shmn
	elseif race == Race.Undead then return shr
	elseif race == Race.Heretic then return sun
	elseif race == Race.Elf then return shmn
	end
end

-- шар на спец. заклы
function ExtraMana(race)

	shmn = orr('g001ig0149','g001ig0150') -- Шар маны Смерти \ Шар маны Лесного эликсира
	sdw = orr('g001ig0150','g001ig0147') -- Шар маны Лесного эликсира \ Шар маны Преисподней
	sun = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	shr = orr('g001ig0146','g001ig0148') -- Шар маны Жизни \ Шар маны Рун
	self = orr('g001ig0149','g001ig0148') -- Шар маны Смерти \ Шар маны Рун

	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- не родной шар
function ExtraNotHomeMana(race)

	shmn = rnd('g001ig0149','g001ig0150','g001ig0148','g001ig0147') -- Смерти \ Лесного эликсира \ Рун \ Преисподней
	sdw = rnd('g001ig0150','g001ig0147','g001ig0149','g001ig0146') -- Лесного эликсира \ Преисподней \ Смерти \ Жизни
	sun = rnd('g001ig0146','g001ig0148','g001ig0150','g001ig0147') -- Жизни \ Рун \ Лесного эликсира \ Преисподней
	shr = rnd('g001ig0146','g001ig0148','g001ig0149','g001ig0150') -- Жизни \ Рун \ Смерти \ Лесного эликсира
	self = rnd('g001ig0147','g001ig0148','g001ig0149','g001ig0146') -- Преисподней \ Рун \ Смерти \ Жизни

	if race == Race.Human then return shmn
	elseif race == Race.Dwarf then return sdw
	elseif race == Race.Undead then return sun
	elseif race == Race.Heretic then return shr
	elseif race == Race.Elf then return self
	end
end

-- случайный малый шар манны
function rmss()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0481' --жизни
	elseif radn == 1 then
	return 'g001ig0485' --лес
	elseif radn == 2 then
	return 'g001ig0482' --преисп.
	elseif radn == 3 then
	return 'g001ig0483' --рун
	elseif radn == 4 then
	return 'g001ig0484' --смерти
	end
end


-- случайный шар манны
function rms()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0146' --жизни
	elseif radn == 1 then
	return 'g001ig0150' --лес
	elseif radn == 2 then
	return 'g001ig0147' --преисп.
	elseif radn == 3 then
	return 'g001ig0148' --рун
	elseif radn == 4 then
	return 'g001ig0149' --смерти
	end
end

-- случайный большой шар манны
function rmsb()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0277' --жизни
	elseif radn == 1 then
	return 'g001ig0281' --лес
	elseif radn == 2 then
	return 'g001ig0278' --преисп.
	elseif radn == 3 then
	return 'g001ig0279' --рун
	elseif radn == 4 then
	return 'g001ig0280' --смерти
	end
end

-- случайный пермо-эликсир на 15% за 1200 -- не использую
function p15()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0308' -- Зелье заступника +15брони
	elseif radn == 1 then
	return 'g001ig0314' -- Эликсир наследия +15урон
	elseif radn == 2 then
	return 'g001ig0310' -- Эликсир опережения +15ини
	elseif radn == 3 then
	return 'g001ig0522' -- Зелье посла +неподкупность
	elseif radn == 4 then
	return 'g001ig0513' -- Зелье твердого шага +5мувов
	end
end

-- для лавок т2 - в какой из низ будет предмет на опыт и будет ли t2var
function expt2go(t2rand)
	local radn = t2var[1]
	if radn == t2rand then
		return exp1[1]
	else
		return ""
	end
end

-- для лавки т3 будет ли предмет на опыт (t3var 50% шанс)
function expt3go()
	local radn = t3var[1]
	if radn == 1 then
		return exp2[1]
	else
		return ""
	end
end

-- сфера для ц.гор. -- не использую
function spherex()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig9023' -- Сфера Инферно 60 горен крест 900
	elseif radn == 1 then
	return 'g000ig9040' -- Сфера Полиморфа 1000
	elseif radn == 2 then
	return 'g000ig9007' -- Сфера понижения уровня 900
	elseif radn == 3 then
	return 'g001ig0181' -- Сфера Страха 800
	end
end

-- сфера вард -- не использую
function spherew()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001ig0056' -- защиты от магии Воды
	elseif radn == 1 then
	return 'g001ig0054' -- защиты от магии Воздуха
	elseif radn == 2 then
	return 'g001ig0055' -- защиты от магии Земли
	elseif radn == 3 then
	return 'g001ig0053' -- защиты от магии Огня
	elseif radn == 4 then
	return 'g001ig0058' -- защиты от магии Разума
	elseif radn == 5 then
	return 'g001ig0057' -- защиты от магии Смерти
	end
end

-- заклы со старта
function CapSpell(race)
	sphmn = rnd('g000ss0002','g000ss0003','g000ss0004') -- Быстрота\Сила\Молния
	spdw = rnd('g000ss0021','g000ss0023','g000ss0024') -- Ледяной щит\Сила Витара\Буран
	spun = rnd('g000ss0062','g000ss0065','g000ss0064') -- Мор\Ржавчина\Слабость
	sphr = rnd('g000ss0045','g000ss0043','g000ss0044') -- Tormentio\Ignis mare\Menta minoris
	spelf = rnd('g000ss0097','g000ss0101','g000ss0106') -- Кустарник\Стая\Смятение

	if race == Race.Human then return sphmn
	elseif race == Race.Dwarf then return spdw
	elseif race == Race.Undead then return spun
	elseif race == Race.Heretic then return sphr
	elseif race == Race.Elf then return spelf
	end
end

-- случайная субраса
function rsub()
	local radn = math.random(0,4)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --гномы
	elseif radn == 4 then
	return {Subrace.Undead, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf} --нежить
	end
end

-- субраса только не нежить + водные
function NoUndead()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end

-- субраса только не нежить + водные - драконы
function NoUndeadDragon()
	local radn = math.random(0,3)
	if radn == 0 then
	return {Subrace.Human, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --люди
	elseif radn == 1 then
	return {Subrace.Elf, Subrace.Neutral, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --эльфы
	elseif radn == 2 then
	return {Subrace.Heretic, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --демоны
	elseif radn == 3 then
	return {Subrace.Dwarf, Subrace.Neutral, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater} --гномы
	end
end


-- случайный эликсир на для руин 0.2 --не использую
function ruin02()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001ig0127' -- Эликсир жизненной силы +50оз 500
	elseif radn == 1 then
	return 'g001ig0128' -- Эликсир защиты от Оружия 400
	elseif radn == 2 then
	return 'g000ig0015' -- Эликсир силы +25урон 425
	elseif radn == 3 then
	return 'g000ig0003' -- Дубовый эликсир +20брони 525
	elseif radn == 4 then
	return 'g001ig0355' -- Зелье тритоньей чешуи (вард урон) 600
	elseif radn == 5 then
	return 'g000ig0018' -- Целебная мазь +200хил 350
	end
end

-- случайный пермо-эликсир на для руин в зоне тренера
function ruinTrainers()
	local radn = math.random(0,5)
	if radn == 0 then
	return 'g001ig0025' -- Аура живучести +10%оз аое 1000
	elseif radn == 1 then
	return 'g001ig0024' -- Аура защиты +10брони аое
	elseif radn == 2 then
	return 'g001ig0021' -- Аура слепой ярости +10атаки аое
	elseif radn == 3 then
	return 'g001ig0031' -- Аура точности +15точности аое
	elseif radn == 4 then
	return 'g001ig0023' -- Аура стремительности +10ини аое
	elseif radn == 5 then
	return 'g001ig0563' -- Аура внимательности +5крит аое
	end
end

-- для фракционного ГО тренер-центр (бывшая для вторых руин в зоне тренера)
function ruinTrainers2()
	local radn = math.random(0,4)
	if radn == 0 then
	return 'g001ig0030' -- Аура скорости +5 ини 800
	elseif radn == 1 then
	return 'g001ig0027' -- Аура брони +5 700
	elseif radn == 2 then
	return 'g001ig0028' -- Аура выносливости +5 оз 600
	elseif radn == 3 then
	return 'g001ig0035' -- Великая аура жизненной силы +30 хп 900
	elseif radn == 4 then
	return 'g001ig0019' -- Малая аура вампиризма +10 вампирик 900
	end
end

-- для руин в зоне тренера --не использую!
function ruinTrainers2Art()
	local radn = math.random(0,3)
	if radn == 0 then
	return 'g000ig3018' -- Клинок Сущего (Артефакт) 1500
	elseif radn == 1 then
	return 'g000ig3021' -- Кольцо Колдуньи (Артефакт) 1800
	elseif radn == 2 then
	return 'g000ig3015' -- Кристалл души (Артефакт) 1800
	elseif radn == 3 then
	return 'g000ig3016' -- Рог Инкуба (Артефакт) 1800
	end
end


--------------
--------------

-- отряды мини зона
function StacksMini()
local tStacksMini = {
	count = 1,
	aiPriority = 0,
} 
if mngmni[1] == 0 then
	tStacksMini.value = { min = 5, max = 5 }
	tStacksMini.leaderIds = {'g000uu5101'} -- Крестьянин
	tStacksMini.loot = {
		items = {
			{ id = 'g001ig0531', min = 1, max = 1 }, -- Зелье слова
			{ id = 'g000ig5084', min = 1, max = 1 }, -- Свиток "Дар"
			{ id = 'g000ig5119', min = 1, max = 1 }, -- Свиток "Водосточный Колодец"
			-- Свитки-светлые т3: Гимн кланов +ини, Святая броня +броня, Святая сила +урон, Отвлечение -ур.точ, Буря уд, Гнев Богов уд, Блуждающий Огонек уд
			{ id = rnd('g000ig5026','g000ig5012','g000ig5013','g000ig5111','g000ig5033','g000ig5014','g000ig5109'), min = 1, max = 1 },
			
			-- Свитки-бафы на статы т4: Великая ловкость +20ини_аое, Призыв к оружию +25урон, Стойкость +22броня, Благословение Всевышнего +20хп+7броня
			-- { id = rnd('g001ig0166','g000ig5017','g000ig5035','g000ig5082'), min = 1, max = 1 },

		}
	}
elseif mngmni[1] == 1 then
	tStacksMini.value = { min = 20, max = 20 }
	tStacksMini.leaderIds = {'g000uu5262'} -- Сектант
	tStacksMini.loot = {
		items = {
			{ id = 'g001ig0531', min = 1, max = 1 }, -- Зелье слова
			{ id = 'g000ig5084', min = 1, max = 1 }, -- Свиток "Дар"
			{ id = 'g000ig5119', min = 1, max = 1 }, -- Свиток "Водосточный Колодец"
			-- Свитки-тёмные т3: Preces -ур.точ, Вампиризм +вам, Жатва +вам, Прикосновение Мортис +оз, Menta potens уд, Драконья порча уд, Блуждающий Огонек уд
			{ id = rnd('g000ig5089','g001ig0093','g001ig0571','g000ig5073','g000ig5054','g000ig5072','g000ig5109'), min = 1, max = 1 },

			-- Свитки-дебафы на статы т4: Tempus status -27ини, Tortio menta -30точн, Гниение -30урон, Плесень -27броня	
			-- { id = rnd('g000ig5091','g000ig5055','g000ig5076','g000ig5114'), min = 1, max = 1 },
		}
	}
end
return tStacksMini
end

-- отряды у тренера
function PredSkinX(omin, omax, olmin, olmax)
return { -- 70 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
	count = 1,
	subraceTypes = { Subrace.NeutralGreenSkin, Subrace.NeutralWolf, Subrace.Neutral },
	value = { min = omin*kef, max = omax*kef },
	loot = {
		itemTypes = { Item.PotionHeal, Item.PotionRevive },
		value = { min = olmin, max = olmax },
		itemValue = { min = 50, max = 250 },
		items = {
			orr3({ id = b15(), min = 1, max = 1 }, { id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /случ. банка15 / случ. вард
		}
	}
}
end

-- отряды варвары
function PredBarb(vmin, vmax, vlmin, vlmax, playerRaceX)
return {
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = { Subrace.NeutralBarbarian, Subrace.NeutralMarsh, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
	value = { min = vmin*kef, max = vmax*kef },
	loot = {
		itemTypes = { Item.Scroll, Item.Orb },
		value = { min = vlmin, max = vlmax },
		itemValue = { min = vlmin, max = vlmax },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
		}
	}
}
end

--- Кастомные субрасы отряды-зленокожие-раса
function customSubraces()
	return {
		{ uid = 'hobo', name = 'Нейтрал', subraceUnits = {
			-- зеленокожие
            'g001uu7547', -- Бутуз 99
            'g000uu7547', -- Бутуз л. 99
			'g000uu5017', -- Гоблин 8
            'g000uu8157', -- Гоблин-громыхун 110
            'g000uu8316', -- Каган Каменной Пасти л. 280
            'g001uu7591', -- Лесоруб 430
            'g000uu7591', -- Лесоруб л. 430 
            'g000uu5115', -- Людоед л. 279
            'g001uu8271', -- Огр 290
            'g000uu8271', -- Огр л. 290
            'g000uu5113', -- Орк л. 80
            'g000uu5013', -- Орк 80
            'g000uu5012', -- Орк-багатур 150
            'g000uu5112', -- Орк-багатур л. 150
            'g001uu7546', -- Орк-крушитель 175
            'g000uu7546', -- Орк-крушитель л. 175
            'g000uu8286', -- Орк-палач л. 210
            'g001uu7545', -- Сегаш 76
            'g000uu7545', -- Сегаш л. 76
            'g000uu8048', -- Старейшина Гоблинов 195
            'g000uu5016', -- Тролль 310
            'g000uu5116', -- Тролль л. 310
            'g000uu8315', -- Хан Каменной Пасти л. 280
            'g000uu8317', -- Хан орков л. 345
            'g000uu8047', -- Циклоп 325
            'g000uu8147', -- Циклоп л. 325
            'g001uu7548', -- Черный тролль 301
            'g000uu7548', -- Черный тролль л. 301
			-- волк
            'g000uu5037', -- Белый медведь 260
            'g000uu5038', -- Бурый медведь 190
            'g000uu5039', -- Волк 90
            'g001uu8282', -- Тенистый паук 210
            'g001uu8284', -- Прядильщик 157
            'g001uu8279', -- Чумной волк 94
			-- нейтралы
            'g000uu8005', -- Дух волка 260
            'g000uu5033', -- Упырь 75
            'g002uu5026', -- Элементаль Воды 95
            'g000uu6104', -- Толстый бес 20
            'g000uu5034', -- Бес 10
            'g000uu8273', -- Абоминат 21
			-- нежить
            'g001uu7539', -- колотун 25
			-- гном
            'g001uu7571', -- Белый волк 190
            'g004uu5039', -- Снежный волк 115
            'g004uu8005', -- Гарм 190
					
		}},
	}
end

-- отряды орки
function PredSkin(omin, omax, olmin, olmax, playerRaceX)
return { -- 80 орк/cегаш, 90 череполом, 110 бутуз, 190! - палач 310! - людоед
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = { 'hobo' },
--	subraceTypes = { Subrace.NeutralGreenSkin, Subrace.Human, Subrace.Undead, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf },
	value = { min = omin*kef, max = omax*kef },
	loot = {
		itemTypes = { Item.PotionHeal, Item.PotionRevive },
		value = { min = olmin, max = olmax },
		itemValue = { min = 50, max = 250 },
		items = {
			orr({ id = b15(), min = 1, max = 1 }, { id = w15(), min = 1, max = 1}), -- случ. банка15 /  случ. вард
		}
	}
}
end


----------------------
-- Отряды т0 респ
---------------------

function zoneStacksRespZ00a(playerRaceX)
return {  -- 165*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 165*kef, max = 165*kef*kr },
	loot = {
		items = {
			{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
			{ id = b15(), min = 1, max = 1 },
		}
	}
}
end
function zoneStacksRespZ00b(playerRaceX)
return {  -- 165*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 165*kef, max = 165*kef*kr },
	loot = {
		items = {
			{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
			{ id = w15(), min = 1, max = 1}, -- случ.вард
		}
	}
}
end
function zoneStacksRespZ00c(playerRaceX)
return {  -- 165*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 165*kef, max = 165*kef*kr },
	loot = {
		items = {
			{ id = torb11[2], min = 1, max = 1 }, -- Сфера 100 в цель
			{ id = rnd(rmss(),'g000ig7001',d15()), min = 1, max = 1 }, -- случ.мал.шар манны / кольцо50 / дотвард
		}
	}
}
end

function zoneStacksRespZ001a(playerRaceX)
return { -- 170*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 170*kef, max = 170*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, -- хил50
			{ id = torb12[2], min = 1, max = 1 }, -- Сфера 100 аое
		}
	}
}
end
function zoneStacksRespZ001b(playerRaceX)
return { -- 170*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 170*kef, max = 170*kef*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 140, max = 140 },
		itemValue = { min = 100, max = 100 },
		items = {
			{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
		}
	}
}
end

function zoneStacksRespZ002a(playerRaceX)
return { -- 175*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 175*kef, max = 175*kef*kr },
	loot = {
		items = {
			{ id = rndy(ttal1), min = 1, max = 1}, -- талик т1
			{ id = b15(), min = 1, max = 1 },
		}
	}
}
end
function zoneStacksRespZ002b(playerRaceX)
return { -- 175*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 175*kef, max = 175*kef*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = w15(), min = 1, max = 1 },
		}
	}
}
end


--------------
-- Отряд проход01
--------------

function zoneStacksP01(playerRaceX)
return { -- 190
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = 190*kef, max = 190*kef*kr },
	loot = {
		items = {
			orr({ id = 'g000ig0005', min = 2, max = 2 }, { id = 'g000ig0006', min = 1, max = 1 }), --2хил50/хил100
			{ id = rnd(rmss(),rmss(),'g001ig0431'), min = 1, max = 1}, -- случ. мал. шар / случ. мал. шар / гранат75
			
		}
	}
}
end

--------------
-- Отряды т1
--------------

-- т1 сила два режима
function vgmode1(val)
local kcross = 1.05 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

----------

function Pred1RespZ0a(playerRaceX)
return {  --200xp*2 -- сферы
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(200), max = vgmode1(200)*kr },
	loot = {
		items = {
			{ id = 'g000ig0005', min = 1, max = 1}, --хил50
			{ id = torb11[6], min = 1, max = 1 }, -- Сфера 100 в цель
			{ id = rnd(e2(),'g000ig0008'), min = 1, max = 1 }, -- e200/точность15
		}
	}
}
end
function Pred1RespZ0b(playerRaceX)
return {  --200xp*2 -- сферы
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(200), max = vgmode1(200)*kr },
	loot = {
		items = {
			{ id = 'g001ig0180', min = 1, max = 1 }, -- хил25
			{ id = orb200RespZ[5], min = 1, max = 1 }, -- Сфера 200
			{ id = rnd(b15(),d15()), min = 1, max = 1 }, -- случ. банка15 / дотвард
		}
	}
}
end

function Pred1RespZ01a(playerRaceX)
return { --250xp*2 -- свиткок т1
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(250), max = vgmode1(250)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 200, max = 200 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g000ig0005', min = 1, max = 1}, --хил50
			{ id = w15(), min = 1, max = 1 },
		}
	}
}
end
function Pred1RespZ01b(playerRaceX)
return { --250xp*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(250), max = vgmode1(250)*kr },
	loot = {
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
			{ id = b15(), min = 1, max = 1}, -- случ. банка15 
		}
	}
}
end

function Pred1RespZ02(playerRaceX)
return { --300xp*1 -- драги75
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(300), max = vgmode1(300)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
			{ id = 'g000ig0008', min = 1, max = 1}, -- точность15
		}
	}
}
end

function Pred1RespZ03(playerRaceX)
return { --310xp*1
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode1(310), max = vgmode1(310)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = e2(), min = 1, max = 1 }, -- эл200
			{ id = rmss(), min = 1, max = 1 }, --случ.мал.шар манны
		}
	}
}
end

function Pred1RespZ04(playerRaceX)
return { -- 330*1
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode1(330), max = vgmode1(330)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = p03[2], min = 1, max = 1 }, -- пермо200+
		}
	}
}
end


function Pred1RespZD(playerRaceX)
return { --350xp*1 -- талисман 200-275
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode1(350), max = vgmode1(350)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g001ig0378','g001ig0378'), min = 1, max = 1 }, --рес/хил75/хил75
			{ id = w15(), min = 1, max = 1 },
			{ id = rndy(ttal2), min = 1, max = 1}, -- талик т2
		}
	}
}
end


------------------
-- Отряды т2
------------------

-- т2 сила два режима
function vgmode2(val)
local kcross = 1.1 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end


--------------
-- Отряд проход12
--------------

function zoneStacksP12(race,playerRaceX)
return { -- 320
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode2(320), max = vgmode2(320)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0006','g000ig0006'), min = 1, max = 1 }, --рес/хил100/хил100
			{ id = rnd(ExtraHomeMana(race),ExtraHomeMana(race),rms(),'g001ig0432'), min = 1, max = 1}, -- родн. шар / родн. шар / случ. шар / аметист125
		}
	}
}
end

----

function zoneStacksResp1(playerRaceX)
return { -- 350xp*1
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(350), max = vgmode2(350)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = w15(), min = 1, max = 1 },
			{ id = rnd(b15(),d15()), min = 1, max = 1 }, 
		}
	},
}
end

function Pred1Resp01a(playerRaceX)
return { -- 350хп*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(350), max = vgmode2(350)*kr },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = 'g001ig0431', min = 1, max = 1 }, --гранат75
			{ id = b15(), min = 1, max = 1 }, 
		}
	}
}
end
function Pred1Resp01b(playerRaceX)
return { -- 380хп*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(380), max = vgmode2(380)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = rnd(w15(),d15()), min = 1, max = 1 },
			{ id = b15(), min = 1, max = 1 }, 
		}
	}
}
end

function zoneStacksRespa(playerRaceX)
return { -- 400xp*2 / сфера 200
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(400), max = vgmode2(400)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = orb200RespZ[6], min = 1, max = 1 }, --сфера 200
			{ id = 'g001ig0485', min = 1, max = 1 }, --мал. шар лес
		}
	},
}
end
function zoneStacksRespb(playerRaceX)
return { -- 400xp*2 / свиток 200
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(400), max = vgmode2(400)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 200, max = 200 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = b15(), min = 1, max = 1 }, 
		}
	},
}
end

function Pred1Resp1a(playerRaceX)
return { -- 400хп*2 
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(400), max = vgmode2(400)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = w15(), min = 1, max = 1 },
			{ id = 'g001ig0483', min = 1, max = 1 }, -- мал. шар рун
		}
	}
}
end
function Pred1Resp1b(playerRaceX)
return { -- 430хп*2 --
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(430), max = vgmode2(430)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = 'g001ig0481', min = 1, max = 1 }, -- мал. шар жизни
		}
	}
}
end

function Pred1Resp2a(playerRaceX)
return { -- 450хп*2 -- свиток т1
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(450), max = vgmode2(450)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 200, max = 200 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, -- хил100
			{ id = e2(), min = 1, max = 1 }, --эл200
		}
	}
}
end
function Pred1Resp2b(playerRaceX)
return { -- 470хп*2 -- 
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(470), max = vgmode2(470)*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = w15(), min = 1, max = 1 },
			{ id = 'g001ig0128', min = 1, max = 1 }, -- оружия
		}
	}
}
end

function Pred1Resp3a(playerRaceX)
return { -- 500хп*2 -- сфера400
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(500), max = vgmode2(500)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, -- рес/хил100
			{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15			
			{ id = orb400RespZ[12], min = 1, max = 1}, --сфера400-699
		}
	}
}
end
function Pred1Resp3b(playerRaceX)
return { -- 500хп*2 -- свиток400
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(500), max = vgmode2(500)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 400, max = 400 },
		itemValue = { min = 400, max = 400 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0482', min = 1, max = 1 }, --мал.шар преисп
		}
	}
}
end

function Pred1Resp4a(playerRaceX)
return { -- 520хп*2 -- пермо
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(530), max = vgmode2(530)*kr },
	loot = {
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0484', min = 1, max = 1 }, -- мал. шар смерти
			{ id = pw4[6], min = 1, max = 1 }, -- пермо-вард-эффект-дот
		}
	}
}
end
function Pred1Resp4b(playerRaceX)
return { -- 550хп -- талик т3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode2(550), max = vgmode2(550)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/рес/хил100
			{ id = 'g001ig0180', min = 1, max = 1}, -- хил25
			{ id = b15(), min = 1, max = 1}, -- случ. банка15
			{ id = rndy(ttal3), min = 1, max = 1}, -- талик т3
		}
	}
}
end

function Pred1Resp5(playerRaceX)
return { -- 550хп*1 -- посох 200
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(550), max = vgmode2(550)*kr },
	loot = {
		itemTypes = { Item.Wand },
		value = { min = 200, max = 200 },
		itemValue = { min = 200, max = 200 },
		items = {
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0180', min = 1, max = 1}, -- хил25
			{ id = e2(), min = 1, max = 1 }, --эл200
		}
	}
}
end

function Pred1RespD(playerRaceX)
return { -- 600хп*1 -- перк 600 / случ. пермо-эликсир на 5%
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode2(600), max = vgmode2(600)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, -- рес/хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
			{ id = p04[2], min = 1, max = 1 }, -- случ. пермо400+
		}
	}
}
end

--------------------
-- Отряды т3
--------------------

-- т3 сила два режима
function vgmode3(val)
local kcross = 1.15 -- усиление для кросса
	if gmode == 1 then
		return val*kef
	elseif gmode == 2 then
		return val*kcross*kef
	end
end

--------------
-- Отряд проход23
--------------

function zoneStacksP23(race1,playerRaceX)
return { -- 570
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode2(570), max = vgmode2(570)*kr },
	loot = {
		items = {
			{ id = rnd('g000ig0001','g000ig0006'), min = 1, max = 1 }, --рес/хил100
			{ id = rnd(ExtraSecondMana(race1),ExtraSecondMana(race1),rms(),'g001ig0433'), min = 1, max = 1}, -- второй. шар / второй. шар / случ. шар / аквамарин175
			{ id = rnd(b15(),w15()), min = 1, max = 1 }, --случ. банка15 / случ. вард
		}
	}
}
end

----

function zoneStacksZone34a(playerRaceX)
return { -- 600xp*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode3(600), max = vgmode3(600)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = w15(), min = 1, max = 1 }, --вард
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = d15(), min = 1, max = 1 }, --случ. дотвард
		}
	},
}
end
function zoneStacksZone34b(playerRaceX)
return { -- 600xp*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode3(600), max = vgmode3(600)*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = w15(), min = 1, max = 1 }, --вард
			{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15			
			{ id = 'g000ig7002', min = 1, max = 1 }, -- кольцо100
		}
	},
}
end
function zoneStacksZone34c(playerRaceX)
return { -- 600xp*3
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = rsub(),
	value = { min = vgmode3(600), max = vgmode3(600)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = b15(), min = 1, max = 1}, -- случ. банка15
			{ id = e4(), min = 1, max = 1 }, --эл400
			{ id = e2(), min = 1, max = 1}, -- e2
		}
	},
}
end

function Pred1Zone1a(playerRaceX)
return { -- 700хп*2 -- свиток т2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(700), max = vgmode3(700)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 400, max = 400 },
		itemValue = { min = 400, max = 400 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0180', min = 1, max = 1}, -- хил25
			{ id = b15(), min = 1, max = 1 }, 
			{ id = e2(), min = 1, max = 1 }, --эликсир200
		}
	}
}
end
function Pred1Zone1b(playerRaceX)
return { -- 700хп*2
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(700), max = vgmode3(700)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0180', min = 1, max = 1}, -- хил25
			{ id = w15(), min = 1, max = 1 },
			{ id = b15(), min = 1, max = 1 }, 		
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
		}
	}
}
end

function Pred1Zone2a(playerRaceX)
return { -- 800хп*2 -- сфера400-500
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(800), max = vgmode3(800)*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
			{ id = b15(), min = 1, max = 1 }, --случ. банка15
			{ id = orb400RespZ[13], min = 1, max = 1}, --сфера400-699
		}
	}
}
end
function Pred1Zone2b(playerRaceX)
return { -- 800хп*2 -- 
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(800), max = vgmode3(800)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			orr({ id = b30(), min = 1, max = 1 }, { id = e4(), min = 1, max = 1 }), -- b30 / сл.эл400
			{ id = w15(), min = 1, max = 1 },
			{ id = b15(), min = 1, max = 1 }, 
		}
	}
}
end

function Pred1Zone3a(playerRaceX)
return { -- 900хп*2 -- элексир буст 425-500
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(900), max = vgmode3(900)*kr },
	loot = {
		itemTypes = { Item.PotionBoost },
		value = { min = 400, max = 540 }, -- эликсир 425-500
		itemValue = { min = 400, max = 540 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = b30(), min = 1, max = 1 }, --b30
		}
	}
}
end
function Pred1Zone3b(playerRaceX)
return { -- 900хп*2 -- свиток 450-650
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	subraceTypes = rsub(),
	count = 1,
	value = { min = vgmode3(900), max = vgmode3(900)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 450, max = 650 },
		itemValue = { min = 450, max = 650 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = b30(), min = 1, max = 1 }, --b30
			{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15			
		}
	}
}
end

function Pred1Zone4a(playerRaceX)
return { -- 1000хп*2 -- пермо
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode3(1000), max = vgmode3(1000)*kr },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = e4(), min = 1, max = 1 }, --эликсир400
			{ id = b15(), min = 1, max = 1 }, 
			{ id = pw6[4], min = 1, max = 1 }, -- пермо-вард-стихия		
		}
	}
}
end
function Pred1Zone4b(playerRaceX)
return { -- 1000хп*2 -- талик
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode3(1000), max = vgmode3(1000)*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = e4(), min = 1, max = 1 }, -- эликсир400
			{ id = e4(), min = 1, max = 1 }, -- эликсир400
			{ id = rndy(ttal4), min = 1, max = 1}, -- талик т4
		}
	}
}
end

function Pred1ZoneD(playerRaceX)
return { --1100хп*1 --свиток т3 + пермо
	owner = playmobsOwner(playerRaceX),
	leaderModifiers = playmobsModif(),
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = vgmode3(1100), max = vgmode3(1100)*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 550, max = 550 },
		itemValue = { min = 550, max = 550 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0018', min = 1, max = 1 }, -- мазь
			{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
			{ id = p05[4], min = 1, max = 1 }, -- случ. пермо-эликсир на 5%
		}
	}
}
end


--------------------
-- Отряды т4 (трежа)
--------------------

function zoneStacksZone5a()
return { -- 1100хп*3 --драги + оз50
	subraceTypes = rsub(),
	count = 1,
	value = { min = 1100*kef, max = 1100*kef*kr},
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = e4(), min = 1, max = 1 }, --
			{ id = 'g001ig0432', min = 1, max = 1 }, --аметист125
		}
	},
}
end
function zoneStacksZone5b()
return { -- 1100хп*3 --драги + крит15
	subraceTypes = rsub(),
	count = 1,
	value = { min = 1100*kef, max = 1100*kef*kr},
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
			{ id = rnd('g002ig0006',e2()), min = 1, max = 1 }, --Зелье бдительности / сл.эл200
			{ id = e4(), min = 1, max = 1 }, 
			{ id = rms(), min = 1, max = 1 }, --случ. шар манны
		}
	},
}
end
function zoneStacksZone5c()
return { -- 1100хп*3 --вард.урон
	subraceTypes = rsub(),
	count = 1,
	value = { min = 1100*kef, max = 1100*kef*kr},
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
			{ id = 'g000ig0008', min = 1, max = 1 }, -- точность15
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = e4(), min = 1, max = 1 }, --

		}
	},
}
end

function zoneStacksZone501()
return { -- 1200 шар
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1200*kef, max = 1200*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g001ig0378', min = 1, max = 1 }, -- хил75
			{ id = e4(), min = 1, max = 1 }, --
			{ id = rms(), min = 1, max = 1 }, -- случ. шар манны
		}
	}
}
end

function zoneStacksZone502()
return { -- 1300 точн30 / сл.банка30 + 25вамп 
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1300*kef, max = 1300*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1 }, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = d15(), min = 1, max = 1 }, --случ.дотвард
			{ id = e4(), min = 1, max = 1 }, -- 
			{ id = rnd('g000ig0009','g000ig0009',b30()), min = 1, max = 1 }, --точность30 / точность30 / сл.банка30
		}
	}
}
end

function zoneStacksZone503()
return { -- 1400 сл.банка30
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1400*kef, max = 1400*kef*kr },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
			{ id = e4(), min = 1, max = 1 }, -- 
			{ id = b30(), min = 1, max = 1 }, -- сл.банка30
		}
	}
}
end

function Pred1Zone51()
return { -- 1500 свиток
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1500*kef, max = 1500*kef*kr },
	loot = {
		itemTypes = { Item.Scroll },
		value = { min = 550, max = 550 },
		itemValue = { min = 550, max = 550 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = d15(), min = 1, max = 1 }, --случ.дотвард
			{ id = b30(), min = 1, max = 1 },
		}
	}
}
end

function Pred1Zone52()
return { -- 1500 сфера
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1500*kef, max = 1500*kef*kr },
	loot = {

		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = b15(), min = 1, max = 1 }, --сл банка15
			{ id = b30(), min = 1, max = 1 },
			{ id = rndx(orbZone34), min = 1, max = 1}, --сферы700-799
		}
	}
}
end

function Pred1Zone53()
return { -- 1600 талик
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1600*kef, max = 1600*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = e2(), min = 1, max = 1 }, -- случ.эл200
			{ id = e2(), min = 1, max = 1}, -- 
			{ id = 'g001ig0128', min = 1, max = 1 }, --оружия
			{ id = rndy(ttal5), min = 1, max = 1}, -- талик т5
		}
	}
}
end

function Pred1Zone54()
return { -- 1600 пермо
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1600*kef, max = 1600*kef*kr },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }, --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = 'g000ig0005', min = 1, max = 1 }, --хил50
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = e4(), min = 1, max = 1 }, --эликсир400
			{ id = rndy(pw8), min = 1, max = 1 }, -- пермо-вард-спец
		}
	}
}
end

function Pred1Zone5D()
return { --1800хп*1 -- пермо
	count = 1,
	subraceTypes = NoUndead(),
	value = { min = 1800*kef, max = 2100*kef },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 }, --рес
			{ id = 'g000ig0018', min = 1, max = 1 }, --хил200
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = rndy(p06), min = 1, max = 1 }, -- пермо600+
			{ id = 'g000ig7003', min = 1, max = 1 }, --изумруд150
			{ id = rms(), min = 1, max = 1 }, -- случ. шар манны
		}
	}
}
end

-------------------------

-- Охрана объектов
--0
function guard0() -- респ0
return {
	value = { min = 170*kef, max = 178*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0005', min = 1, max = 1}, { id = 'g001ig0180', min = 2, max = 2}), -- хил50/2хил25
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g000ig7001', min = 1, max = 1}), -- случ. мал. шар / кольцо50
		},
	}
}
end

--1
function guard1() -- зона1 --драги 250-375
return {
	value = { min = 250*kef, max = 260*kef },
	loot = {
		items = {
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			orr({ id = rmss(), min = 1, max = 1}, { id = 'g000ig7001', min = 1, max = 1}), -- случ. мал. шар / кольцо50
		},
	}
}
end

--2
function guard2() -- зона2 --драги 250
return {
	value = { min = 400*kef, max = 420*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 250, max = 250 },
		itemValue = { min = 250, max = 250 },
		items = {
			orr({ id = 'g000ig0006', min = 1, max = 1}, { id = 'g000ig0005', min = 2, max = 2}), -- хил100/2хил50
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard2n() -- зона2 наём.
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

function guard2r() -- зона2 обменник
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			orr({ id = 'g001ig0431', min = 1, max = 1 }, { id = rmss(), min = 1, max = 1 }), --гранат75/случ. мал.шар манны
			{ id = e2(), min = 1, max = 1 },
		},
	}
}
end

function guard2m() -- зона2 башн.
return {
	value = { min = 450*kef, max = 475*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = rmss(), min = 1, max = 1 }, -- случ. мал.шар манны
			{ id = w15(), min = 1, max = 1 }, --случ. вард стих.
		},
	}
}
end

--3
function guard3m() -- зона3 башн.
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g001ig0378', min = 1, max = 1}, --хил75
			{ id = rms(), min = 1, max = 1}, --случ. шар манны
			{ id = w15(), min = 1, max = 1}, -- случ. вард
		},
	},
}
end

function guard3() -- зона3 --драги 500
return {
	value = { min = 700*kef, max = 735*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 500, max = 500 },
		itemValue = { min = 500, max = 500 },
		items = {
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			orr({ id = 'g000ig0005', min = 1, max = 1}, { id = 'g001ig0180', min = 2, max = 2}), -- хил50/2хил25
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard3n() -- зона3 наём.
return {
	value = { min = 750*kef, max = 790*kef },
	loot = {
		items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g001ig0378', min = 1, max = 1}, --хил75
				{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
				{ id = w15(), min = 1, max = 1}, -- случ. вард
		},
	}
}
end

--4
function guard4() -- зона4 центр --драги
return {
	value = { min = 1200*kef, max = 1260*kef },
	loot = {
		itemTypes = { Item.Valuable },
		value = { min = 950, max = 950 },
		itemValue = { min = 500, max = 750 },
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, --хил100
			{ id = b15(), min = 1, max = 1 }, --случ. банка на 15
		},
	}
}
end

function guard4r() -- зона4 центр обменник
return {
	value = { min = 1100*kef, max = 1100*kef },
	loot = {
		items = {
			orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
			{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
			orr({ id = 'g001ig0432', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --аметист125/случ. шар манны
			{ id = e4(), min = 1, max = 1 }, --
		},
	}
}
end

function guard4n() -- зона4 центр наём.
return {
	value = { min = 1000*kef, max = 1000*kef },
	loot = {
		items = {
				orr({ id = 'g000ig0001', min = 1, max = 1 }, { id = 'g000ig0006', min = 1, max = 1 }), --рес/хил100
				{ id = 'g000ig0006', min = 1, max = 1}, -- хил100
				{ id = e4(), min = 1, max = 1 }, -- 
				{ id = b30(), min = 1, max = 1 }, -- 
				{ id = rnd(b15(),b15(),w15()), min = 1, max = 1 }, --случ.банка15/вард
		},
	}
}
end

function guardbanka(x) -- отряд с банкой на жезлы в центре -- не использую
	if x == banka then
		return {
			  order = { type = Order.Guard },
			leaderIds = {'g000uu5201'}, -- Сквайр
			value = { min = 22, max = 22 },
			loot = {
				items = {
					{ id = 'g001ig0378', min = 1, max = 1}, -- хил75
					{ id = 'g001ig0524', min = 1, max = 1}, -- банка	
				},
			}
		}
		else return {}
	end
end

------------------

-- Главная охрана проходпрохода между зонами 1-4
function zoneGuardZone00(restx,resty,restz)
return {
	subraceTypes = {Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf, Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralElf, Subrace.NeutralGreenSkin, Subrace.NeutralMarsh, Subrace.NeutralWater, Subrace.NeutralBarbarian, Subrace.NeutralWolf, Subrace.NeutralWater}, -- Subrace.Undead, Subrace.NeutralDragon,  убрал
	value = { min = 630*kef, max = 660*kef }, 
	leaderIds = goldr14,
	-- сопротивляемость ворам -10
	leaderModifiers = {'g201um9131'},
	loot = {
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 },
			{ id = 'g000ig0006', min = 1, max = 1 },
			{ id = 'g001ig0378', min = 1, max = 1 }, --хил75
			orr({ id = 'g001ig0432', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --Аметист125/случ. шар
			{ id = b15(), min = 1, max = 1 }, --случ. банка15
			{ id = w15(), min = 1, max = 1 }, -- случ. банка вард
			{ id = rnd(restx,resty), min = 1, max = 1}, -- пермо200+ / пермо-вард-эффект-дот

			--{ id = fbanka(1), min = 1, max = 1 }, -- Зелье завоевателя (желы)

			-- банка на талики / реген-точность / банка на жезлы
			{ id = restz, min = 1, max = 1 },			
		}
	}
}
end

-- Главная охрана прохода между зонами 2-4
function zoneGuardZone0(restx,resty)
local getperk = rndynldr(tp2p)
--local getnameldr = nldr
local getraceldr = rldr
return {
	--subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	subraceTypes = getraceldr, -- раса отряда лидера
	value = { min = 1050*kef, max = 1100*kef }, 
	leaderIds = goldr24,
	-- сопротивляемость ворам -10
	leaderModifiers = {'g201um9131'},
	-- имя по банке на перк в луте
	--name = getnameldr,
	loot = {
--		itemTypes = { Item.PotionPermanent },
--		value = { min = 700, max = 700 },
--		itemValue = { min = 400, max = 500 },
		items = {
			{ id = 'g000ig0001', min = 1, max = 1 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7004', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --кольцо200/случ. шар манны
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = rnd(b15(),w15(),w15()), min = 1, max = 1 }, --случ. банка вард 66% / случ. банка15 33%
			{ id = e2(), min = 1, max = 1}, --
			{ id = rnd(restx,resty), min = 1, max = 1}, -- пермо400+ / пермо-вард-эффект-дот
			{ id = getperk, min = 1, max = 1}, --случ.банка на перк
		}
	}
}
end

-- Главная охрана прохода между зонами 3-4
function zoneGuardZone(restx,resty)
local getperk = rndynldr(tp2p)
--local getnameldr = nldr
local getraceldr = rldr
return {
	--subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	subraceTypes = getraceldr, -- раса отряда лидера
	value = { min = 1600*kef, max = 1680*kef },
	leaderIds = goldr34,
	-- сопротивляемость ворам -10
	leaderModifiers = {'g201um9131'},
	-- имя по банке на перк в луте
	--name = getnameldr,
	loot = {
--		itemTypes = { Item.PotionPermanent },
--		value = { min = 1100, max = 1100 },
--		itemValue = { min = 600, max = 800 },
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			orr({ id = 'g000ig7005', min = 1, max = 1 }, { id = rms(), min = 1, max = 1 }), --рубин/случ. шар манны
			{ id = e2(), min = 1, max = 1 }, --эл200
			{ id = rnd(b15(),b15(),w15()), min = 1, max = 1 }, --случ. банка вард 33% / случ. банка15 66%
			{ id = e4(), min = 1, max = 1 }, --
			{ id = rnd(restx,resty), min = 1, max = 1}, -- пермо600+ / пермо-вард-стихия
			{ id = getperk, min = 1, max = 1}, --случ.банка на перк
		}
	}
}
end


-- Главная охрана прохода между зонами очень-сильная ГО т3-тренер
function zoneGuardZoneR()

-- Знамя войны / Знамя Здоровья / Знамя стойкости / Стяг багровых рек / Стяг Кровавого Ворона
-- / Гравированная диадема / Боевая коса (только тут) / Коготь Пожирателя / Кольцо Несгибаемого стража / Копье Ангела / Кама Кровавого Ворона / Кольцо веков (только тут)
-- / Корона Империи (Реликвия) / Тяжелые латы (Реликвия) / Доспех рыцаря Феникса (Реликвия) / Меч рыцаря Феникса (Артефакт) / Щит рыцаря Феникса (Артефакт) 
-- / Кираса Кровавого Ворона (Реликвия) / Серп Кровавого Ворона (Артефакт)
local itemGuardZoneR = {'g000ig1016','g000ig1017','g000ig1015','g001ig0366','g002ig0016',
'g000ig2005','g001ig0179','g001ig0102','g001ig0488','g002ig0017','g002ig0014','g000ig3006', 
'g000ig7010','g001ig0038','g002ig0012','g002ig0010','g002ig0011','g002ig0015',
'g002ig0013'}

mix(itemGuardZoneR)

return {
	--subraceTypes = { Subrace.NeutralDragon, Subrace.Human, Subrace.Heretic, Subrace.Dwarf, Subrace.Elf }, -- Subrace.Undead, убрал
	value = { min = 2280*kef, max = 2400*kef },
	leaderIds = goldr3t,
	-- сопротивляемость ворам -10
	leaderModifiers = {'g201um9131'},
	loot = {
		items = {
			{ id = itemGuardZoneR[1], min = 1, max = 1 },
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			{ id = 'g000ig0018', min = 1, max = 1 }, --мазь
			{ id = rnd(rmsb(),'g000ig7006'), min = 1, max = 1 }, --сл.большой шар/Сапфир
			{ id = e2(), min = 1, max = 1}, -- эл200
			{ id = e4(), min = 1, max = 1 }, --эликсир400
			{ id = rnd(rndy(p06),rndy(pw8)), min = 1, max = 1 }, -- пермо600+ / пермо-вард-спец
		}
	}
}
end

--
-- Охрана прохода тренен-центр фракционная --не использую!
function zoneGuardZoneT(playerRace,ban,art1,art2,tom,bot)
local x0 = 0
local x1 = 0
local ZoneTt = {
	subraceTypes = { getPlayerSubRace(playerRace), Subrace.Neutral, Subrace.NeutralHuman, Subrace.NeutralGreenSkin, Subrace.NeutralDragon, Subrace.NeutralMarsh, Subrace.NeutralBarbarian, Subrace.NeutralWolf }, 
	value = { min = 1900*kef, max = 2000*kef },
	leaderIds = ldhero(playerRace),
	leaderModifiers = {
		'g000um9031','g000um9031', -- лидерство +2=6
		'g000um9001','g000um9001','g000um9001','g000um9001', -- хп 20!4=100%
		'g000um9009','g000um9009','g000um9009','g000um9009','g000um9009','g000um9009','g000um9009','g000um9009', -- повреждения 10!8=100%
		'g201um9130','g201um9130','g201um9130','g201um9130','g201um9130', -- сопрот.ворам 10!5=50
		'g070um0058', -- сопрот.удар.магии 30 (Протектор III)
		'g070um0345', -- дебафы -50% (Подавление проклятий III)
	},
	equipment = {
		battle1 = rnd('g001ig0443','g000ig9021','g000ig9016','g001ig0203','g001ig0462','g001ig0183','g001ig0455','g001ig0131','g001ig0259','g000ig9128','g001ig0063','g000ig9116','g000ig0018','g000ig0018','g000ig0018','g000ig0018'), -- предмет в левый слот: сфера600-799(без урона вцель) / талика600-800x4 / хил200x4
		battle2 = rnd('g000ig0006','g000ig0006','g000ig0006','g000ig0001'), -- хил100x3/рес
	 },
	loot = {
		items = {
			{ id = 'g000ig0001', min = 2, max = 2 },
			{ id = 'g000ig0006', min = 2, max = 2 },
			{ id = ruinTrainers2(), min = 1, max = 1 },
			{ id = rnd(rmsb(),'g000ig7007'), min = 1, max = 1 }, --сл.большой шар/Алмаз350			
		}
	}
}

--.equipment
repeat
	x0 = math.random (0,1)
	if x0 == 1 and x1~=2 then
		ZoneTt.equipment.banner = ban
		x1=x1+x0
	end
	x0 = math.random (0,1)
	if x0 == 1 and x1~=2 then
		ZoneTt.equipment.artifact1 = art1
		x1=x1+x0
	end
	x0 = math.random (0,1)
	if x0 == 1 and x1~=2 then
		ZoneTt.equipment.artifact2 = art2
		x1=x1+x0
	end
	x0 = math.random (0,1)
	if x0 == 1 and x1~=2 then
		ZoneTt.equipment.tome = tom
		x1=x1+x0
	end
	x0 = math.random (0,1)
	if x0 == 1 and x1~=2 then
		ZoneTt.equipment.boots = bot
		x1=x1+x0
	end
until x1==2

return ZoneTt
end

----------------------


-- СВОДНЫЕ ТАБЛИЦЫ
-- Вернет таблицу с описанием Респа 0

function getPlayerZone00(zoneId, playerRace, playerRaceX, zoneSize)

	return {
		id = zoneId,
		type = Zone.PlayerStart,
		race = playerRace,
		size = zoneSize,
		label = 0,
		--border = Border.Open,
		mines = getMinesRespZ(playerRace),
		merchants = zoneMerchRespZ0(),
		ruins = zoneRuinRespZ0(),
		bags = bagsResp00(),
		stacks = {zoneStacksRespZ00a(playerRaceX), zoneStacksRespZ00b(playerRaceX), zoneStacksRespZ00c(playerRaceX), zoneStacksRespZ001a(playerRaceX), zoneStacksRespZ001b(playerRaceX), zoneStacksRespZ002a(playerRaceX), zoneStacksRespZ002b(playerRaceX), PredSkin(130, 143, 100, 100,playerRaceX), PredSkin(140, 154, 100, 100,playerRaceX)},

		capital = {
			buildings = getBuildings(playerRace),
			gapMask = 15,
			garrison = { -- столица
				subraceTypes = { getPlayerSubRace(playerRace) },
				value = { min = 50, max = 50 },
				loot = {
					itemTypes = { Item.Orb, Item.Scroll },
					value = { min = 400, max = 400 },
					itemValue = { min = 400, max = 400 },
					items = {
						{ id = 'g000ig0001', min = 4, max = 4}, --рес
						{ id = 'g000ig0006', min = 4, max = 4}, --хил100
						{ id = 'g001ig0378', min = 3, max = 3}, --хил75
						{ id = 'g000ig0005', min = 5, max = 5}, -- хил50
						{ id = 'g001ig0180', min = 6, max = 6}, -- хил25

						{ id = 'g000ig0002', min = 1, max = 1 }, --15
						{ id = 'g000ig0014', min = 1, max = 1 }, --15
						{ id = 'g000ig0011', min = 1, max = 1 }, --15
						{ id = 'g000ig0008', min = 2, max = 2 }, --15
						{ id = b15(), min = 1, max = 1}, -- случ. банка15

						{ id = 'g000ig0021', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0022', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0023', min = 1, max = 1 }, -- вард
						{ id = 'g000ig0024', min = 1, max = 1 }, -- вард
						{ id = w15(), min = 1, max = 1}, -- случ. вард

						{ id = 'g001ig0125', min = 1, max = 1 }, -- разума
						{ id = 'g001ig0036', min = 1, max = 1 }, -- смерти
						{ id = rnd('g001ig0125','g001ig0036'), min = 1, max = 1 }, --разума/смерти
			
						{ id = rnd('g001ig0128','g001ig0355'), min = 1, max = 1}, -- вард оружия / Зелье тритоньей чешуи
						{ id = rnd('g001ig0128','g001ig0355','g001ig0127','g000ig0015','g000ig0003','g000ig0018'), min = 1, max = 1}, -- вард оружия / Зелье тритоньей чешуи / Эликсир жизненной силы +50оз 500 / Эликсир силы +25урон 425 / Дубовый эликсир +20брони 525 / Целебная мазь +200хил 350

						-- сфера
						{ id = torb11[1], min = 1, max = 1}, -- Сфера 100 в цель
						{ id = torb12[1], min = 1, max = 1}, -- Сфера 100 аое

						-- свиток
						{ id = rnd('g000ig5021','g000ig5003','g000ig5002','g001ig0072','g000ig5007','g000ig5102'), min = 1, max = 1}, -- свиток л.щит / сила / быстрота / Свиток "Соколиная зоркость"+2вижн / Свиток "Исцеление" / Свиток "Стойкость рощи" +15оз
						{ id = rnd('g001ig0248','g000ig5106','g000ig5064','g000ig5101','g000ig5044','g001ig0247'), min = 1, max = 1}, -- свиток устр.гимн-ини / смятение-ини / слабость-5урон.ини / стая-10урон / Menta minoris-5урон.точн / неудача-10точн

						{ id = ExtraNotHomeMana(playerRace), min = 1, max = 1 }, -- не родной шар
					}
				},
			},
			spells = {
				CapSpell(playerRace)
			}
		}
	}
end

-- Вернет таблицу с описанием зоны 1
function getPlayerZone0(zoneId, playerRace, playerRaceX, zoneSize)

	return {
		id = zoneId,
		type = Zone.Junction,
		race = playerRace,
		size = zoneSize,
		label = 1,
		merchants = zoneMerchRespZ(),
		towns = zoneTownsResp0(playerRace),
		ruins = zoneRuinRespZ(),
		mercenaries = zoneMercenZoneX(playerRace),
		bags = bagsResp0(),
		mines = getMinesRespZ2(playerRace),
		stacks = {Pred1RespZ0a(playerRaceX), Pred1RespZ0b(playerRaceX), Pred1RespZ01a(playerRaceX), Pred1RespZ01b(playerRaceX), Pred1RespZ02(playerRaceX), Pred1RespZ03(playerRaceX), Pred1RespZ04(playerRaceX), Pred1RespZD(playerRaceX), PredSkin(210, 220, 200, 225,playerRaceX), PredBarb(220,230,0,0,playerRaceX)},

	}
end

-- Респ: Вернет таблицу с описанием зоны 2
function getPlayerZone(zoneId, playerRace, playerRaceX, zoneSize)
	return {
		id = zoneId,
		type = Zone.Junction, -- Junction -- Treasure
		race = playerRace,
		size = zoneSize,
		label = 2,
		merchants = zoneMerchResp(),
		towns = zoneTownsResp(playerRace),
		ruins = zoneRuinResp(),
		mercenaries = zoneMercenZone12(playerRace),
		mines = getMinesResp(playerRace),
		mages = zoneMageResp(),
--		resourceMarkets = rMarketsZone2(),
		stacks = {zoneStacksRespa(playerRaceX), zoneStacksRespb(playerRaceX), zoneStacksResp1(playerRaceX), Pred1Resp01a(playerRaceX), Pred1Resp01b(playerRaceX), Pred1Resp1a(playerRaceX), Pred1Resp1b(playerRaceX), Pred1Resp2a(playerRaceX), Pred1Resp2b(playerRaceX), Pred1Resp3a(playerRaceX), Pred1Resp3b(playerRaceX), Pred1Resp4a(playerRaceX), Pred1Resp4b(playerRaceX), Pred1Resp5(playerRaceX), Pred1RespD(playerRaceX), PredSkin(390, 400, 200, 250,playerRaceX), PredBarb(480,484,200,200,playerRaceX)},
		bags = bagsResp(),
	}
end

-- Вернет таблицу с описанием зоны 3
function getTreasureZone34(zoneId, playerRace, playerRaceX, zoneSizeTre)
	return {
		id = zoneId,
		race = playerRace,
		type = Zone.Junction,
		size = zoneSizeTre,
		label = 3,
		merchants = zoneMerchZone34(),
		towns = zoneTownsZone34(playerRace),
		ruins = zoneRuinZone34(),
		mines = getMinesZone34(playerRace),
		mages = zoneMageZone34(),
		mercenaries = zoneMercenZone(playerRace),
		stacks = {zoneStacksZone34a(playerRaceX), zoneStacksZone34b(playerRaceX), zoneStacksZone34c(playerRaceX), Pred1Zone1a(playerRaceX), Pred1Zone1b(playerRaceX), Pred1Zone2a(playerRaceX), Pred1Zone2b(playerRaceX), Pred1Zone3a(playerRaceX), Pred1Zone3b(playerRaceX), Pred1Zone4a(playerRaceX), Pred1Zone4b(playerRaceX), Pred1ZoneD(playerRaceX), PredBarb(770,774,400,400,playerRaceX) },
		bags = bagsZone34(),
	}
end

-- Вернет таблицу с описанием зоны 4 (центр)
function getTreasureZone5(zoneId, playerRace, playerRace2, zoneSizeTre)
	return {
		race = playerRace,
		race2 = playerRace2,
		id = zoneId,
		type = Zone.Treasure,
		size = zoneSizeTre,
		label = 4,
		merchants = zoneMerchZone5(),
		towns = zoneTownsZone5(),
		mercenaries = zoneMercenZone4(playerRace, playerRace2),
		ruins = zoneRuinZone5(),
		mines = getMinesZone5(playerRace, playerRace2),
		resourceMarkets = rMarketsZone5(),
		stacks = {zoneStacksZone5a(), zoneStacksZone5b(), zoneStacksZone5c(), zoneStacksZone501(), zoneStacksZone502(), zoneStacksZone503(), Pred1Zone51(), Pred1Zone52(), Pred1Zone53(), Pred1Zone54(), Pred1Zone5D(), PredBarb(1550,1600,500,600) },
		bags = bagsZone5(playerRace, playerRace2),
		mages = zoneMageTrainer(),
	}
end

-- Вернет таблицу с описанием зоны-тренера
function getTreasureZoneTrainers(zoneId, playerRace, zoneSizeTre)
	return {
		--border = Border.Water,
		id = zoneId,
		ruins = zoneRuinTrainersCross(),
		race = playerRace,
		type = Zone.Junction,  -- Junction -- Treasure
		size = zoneSizeTre,
		mines = getMinesX(playerRace),
		bags = bagsRespX(), -- криво генерит с сундуком!
		stacks = { PredSkinX(13/kef, 25/kef, 0, 0), PredSkinX(26/kef, 32/kef, 50, 50), PredSkinX(40/kef, 55/kef, 100, 100), PredSkinX(60/kef, 70/kef, 150, 150) },
		trainers = {{ guard = gmm({}, PredSkin(90, 100, 100, 100)) }},
	}
end

-- Вернет таблицу с описанием минизон
function getEmptyZone(zoneId, playerRace, zoneSizeTre)
local tEmptyZone = {
	id = zoneId,
	race = playerRace,
	type = Zone.Treasure,
	size = zoneSizeTre,
	fill = Fill.Forest,
	--border = Border.Open,	
}
	tEmptyZone.stacks = {StacksMini()}
return tEmptyZone
end

--
function getHostZone(zoneId, playerRace, zoneSizeTre)
local tHostZone = {
	id = zoneId,
	race = playerRace,
	type = Zone.PlayerStart,
	size = zoneSizeTre,
	fill = Fill.Forest,
	--border = Border.Open,	
}
	tHostZone.stacks = {StacksMini()}
return tHostZone
end

-------------------------------------------------


-- РАЗМЕРЫ ЗОН: Вернет таблицу с зонами
function getZones(races)
	local zones = {}

	local z910 = 4 -- 3.8 -- 4 -- тренер 50
	local z08 = 5 -- 5.2 -- 5 -- т0 стольня 50
	local z17 = 5 -- 5.6 -- 6 -- т1 60
	local z26 = 8 -- 9.2 -- 9 -- т2 90
	local z35 = 7 -- 8.2 -- 8 -- т3 82
	local z4 = 12 -- 11.6 -- 12 -- центр 120 /G/ 110 = gmm(12,11)
	local zh = 2.4 -- 2.4 -- минизоны
	
	-- перемешать таблицу предметов на опыт для лавок т2
	mix(exp1)
	-- перемешать таблицу предметов на опыт для лавок т3
	mix(exp2)
	-- перемешать таблицу выбора лавки размещения предметов на опыт в лавке т2а/т2б/нет/нет (50%)
	mix(t2var)
	-- перемешать таблицу выбора шанса размещения предметов на опыт в лавке т3 (50%)
	mix(t3var)
	
	-- ИГРОК1
	gtal1() gtal2() gtal3() gtal4() gtal5()  -- [сброс т.таликов для игрока]
	gtp0p() -- [сброс т.перков для игрока]
	gts1p() -- [сброс т.свитков для игрока]

	-- перемешать для 1 расы таблицу сфер т11
	mix(torb11)
	-- перемешать для 1 расы таблицу сфер т12
	mix(torb12)
	-- перемешать банки для игрока 1
	mix(p03) mix(p04) mix(p05) mix(pw4) mix(pw6) 
	-- перемешать таблицы всех предметов для игрока 1
	mix(orb200RespZ) mix(orb400RespZ) mix(orbZone34)
	mix(artRespZ0) mix(relRespZ0) mix(bootRespZ0)
	mix(artRespZ) mix(relRespZ) mix(bootRespZ) mix(flagRespZ)
	mix(artResp1) mix(relResp1) mix(flagResp1) mix(bootResp1)
	mix(artZone34) mix(relZone34) mix(flagZone34) mix(bootZone34)
	
	zones[1] = getPlayerZone00(0, races[1], races[2], z08) -- т0 красный 5

	-- перемешать для 1 расы таблицу для ист-ков
	mix(tbl)

	zones[11] = getTreasureZoneTrainers(10, races[1], z910) -- трен. т.зелёный
	zones[2] = getPlayerZone0(1, races[1], races[2], z17) -- т1 зелёный 6(7)
	zones[3] = getPlayerZone(2, races[1], races[2], z26) -- т2 синий 9(10)
	zones[4] = getTreasureZone34(3, races[1], races[2], z35) -- т3 белый 8(9)

	-- перенос остатков предметов игрока 1 для ГО
	tp0prest1[1] = tp0p[3]
	p03rest1[1] = p03[3]
	p04rest1[1] = p04[3]
	p05rest1[1] = p05[5]
	pw4rest1[1] = pw4[7] pw4rest1[2] = pw4[8]
	pw6rest1[1] = pw6[5]
	flagResp1rest1[1] = flagResp1[9]
	artResp1rest1[1] = artResp1[10] artResp1rest1[2] = artResp1[11]
	relResp1rest1[1] = relResp1[9]
	bootResp1rest1[1] = bootResp1[4]

	-- ИГРОК2
	gtal1() gtal2() gtal3() gtal4() gtal5()  -- [сброс т.таликов для игрока]
	gtp0p() -- [сброс т.перков для лавок]
	gts1p() -- [сброс т.свитков для игрока]	

	-- перемешать для 2 расы таблицу сфер т11
	mix(torb11)
	-- перемешать для 2 расы таблицу сфер т12
	mix(torb12)
	-- перемешать банки для игрока 2
	mix(p03) mix(p04) mix(p05) mix(pw4) mix(pw6) 
	-- перемешать таблицы всех предметов для игрока 2
	mix(orb200RespZ) mix(orb400RespZ) mix(orbZone34)
	mix(artRespZ0) mix(relRespZ0) mix(bootRespZ0)
	mix(artRespZ) mix(relRespZ) mix(bootRespZ) mix(flagRespZ)
	mix(artResp1) mix(relResp1) mix(flagResp1) mix(bootResp1)
	mix(artZone34) mix(relZone34) mix(flagZone34) mix(bootZone34)
	
	zones[9] = getPlayerZone00(8, races[2], races[1], z08) -- т0 пурпурный

	-- перемешать для 2 расы таблицу для ист-ков
	mix(tbl)
	
	zones[10] = getTreasureZoneTrainers(9, races[2], z910) -- трен. оранжевый
	zones[8] = getPlayerZone0(7, races[2], races[1], z17) -- т1 голубой
	zones[7] = getPlayerZone(6, races[2], races[1], z26) -- т2 жёлтый
	zones[6] = getTreasureZone34(5, races[2], races[1], z35) -- т3 серый

	-- перенос остатков предметов игрока 2 для ГО
	tp0prest2[1] = tp0p[3]
	p03rest2[1] = p03[3]
	p04rest2[1] = p04[3]
	p05rest2[1] = p05[5]
	pw4rest2[1] = pw4[7] pw4rest2[2] = pw4[8]
	pw6rest2[1] = pw6[5]
	flagResp1rest2[1] = flagResp1[9]
	artResp1rest2[1] = artResp1[10] artResp1rest2[2] = artResp1[11]
	relResp1rest2[1] = relResp1[9]
	bootResp1rest2[1] = bootResp1[4]
	
	
	-- ЦЕНТР
	-- перемешать таблицы всех предметов центра
	mix(artZone5) mix(relZone5) mix(flagZone5) mix(bootZone5) mix(orbZone5)

	zones[5] = getTreasureZone5(4, races[1], races[2], z4) -- центр чёрный 12(13)

	-- МИНИ ЗОНЫ
		
	if smode == 2 then
		mix(mngmni) -- перемешать таблицу для минизон
		zones[12] = getHostZone(13, races[3], zh)
		mix(mngmni) -- перемешать таблицу для минизон
		zones[13] = getEmptyZone(14, races[3], zh)
	elseif smode == 1 then
		mix(mngmni) -- перемешать таблицу для минизон
		zones[12] = getEmptyZone(13, races[3], zh)
		mix(mngmni) -- перемешать таблицу для минизон
		zones[13] = getEmptyZone(14, races[3], zh)
	end

	return zones
end

----------------------

-- ПРОХОДЫ: Вернет таблицу с проходами между зонами:
function getZoneConnections(races,ban,art1,art2,tom,bot)
local connections = {

	-- т1 в центр
	{from = 1, to = 4, size = 1, guard = zoneGuardZone00(p03rest1[1],pw4rest1[1],tp0prest1[1])},
	{from = 7, to = 4, size = 1, guard = zoneGuardZone00(p03rest2[1],pw4rest2[1],tp0prest2[1])},

	-- т2 в центр
	{from = 2, to = 4, size = 1, guard = zoneGuardZone0(p04rest1[1],pw4rest1[2])},
	{from = 6, to = 4, size = 1, guard = zoneGuardZone0(p04rest2[1],pw4rest2[2])},

	-- т3 в центр
	{from = 3, to = 4, size = 1, guard = zoneGuardZone(p05rest1[1],pw6rest1[1])},
	{from = 5, to = 4, size = 1, guard = zoneGuardZone(p05rest2[1],pw6rest2[1])},

	-- тренер т3_соперника
	{from = 3, to = 9, size = 1, guard = zoneGuardZoneR()},
	{from = 5, to = 10, size = 1, guard = zoneGuardZoneR()},

	-- зоны игрок1 т0-т3
	{from = 0, to = 1, size = 2, distance = rnd(1,2)}, {from = 0, to = 1, size = 2, distance = rnd(1,2)}, {from = 0, to = 1, guard = gmm('',zoneStacksP01(races[2])), size = 2, distance = rnd(1,2)},
	{from = 1, to = 2, size = 2, distance = rnd(1,2)}, {from = 1, to = 2, size = 2, distance = rnd(1,2)}, {from = 1, to = 2, size = 2, distance = rnd(1,2)}, {from = 1, to = 2, guard = gmm('',zoneStacksP12(races[1],races[2])), size = 2, distance = rnd(1,2)}, 
	{from = 2, to = 3, size = 2, distance = rnd(1,2)}, {from = 2, to = 3, size = 2, distance = rnd(1,2)}, {from = 2, to = 3, size = 2, distance = rnd(1,2)}, {from = 2, to = 3, guard = gmm('',zoneStacksP23(races[1],races[2])), size = 2, distance = rnd(1,2)},

	-- зоны игрок2 т0-т3
	{from = 7, to = 8, size = 2, distance = rnd(1,2)}, {from = 7, to = 8, size = 2, distance = rnd(1,2)}, {from = 7, to = 8, guard = gmm('',zoneStacksP01(races[1])), size = 2, distance = rnd(1,2)},
	{from = 6, to = 7, size = 2, distance = rnd(1,2)}, {from = 6, to = 7, size = 2, distance = rnd(1,2)}, {from = 6, to = 7, size = 2, distance = rnd(1,2)}, {from = 6, to = 7, guard = gmm('',zoneStacksP12(races[2],races[1])), size = 2, distance = rnd(1,2)},
	{from = 5, to = 6, size = 2, distance = rnd(1,2)}, {from = 5, to = 6, size = 2, distance = rnd(1,2)}, {from = 5, to = 6, size = 2, distance = rnd(1,2)}, {from = 5, to = 6, guard = gmm('',zoneStacksP23(races[2],races[1])), size = 2, distance = rnd(1,2)},

	-- т0 тренер
-- С фракционной охраной	
--	{from = 0, to = 10, size = 3, guard = zoneGuardZoneT(races[1],flagResp1rest1[1],artResp1rest1[1],artResp1rest1[2],relResp1rest1[1],bootResp1rest1[1])},
--	{from = 9, to = 8, size = 3, guard = zoneGuardZoneT(races[2],flagResp1rest2[1],artResp1rest2[1],artResp1rest2[2],relResp1rest2[1],bootResp1rest2[1])},

	{from = 0, to = 10, size = 2, distance = 1},
	{from = 0, to = 10, size = 1},
	{from = 9, to = 8, size = 2, distance = 1},
	{from = 9, to = 8, size = 1},

	-- тренер в центр
	{from = 10, to = 4, size = 1, distance = 1}, {from = 10, to = 4, size = 1, distance = 1},
	{from = 9, to = 4, size = 1, distance = 1}, {from = 9, to = 4, size = 1, distance = 1},

	--респ в центр (связь без прохода)
	{from = 0, to = 4, size = 0},
	{from = 8, to = 4, size = 0},

}

	if smode == 1 or smode == 2 then
	
		-- минизоны в т0 и в т1 (связь без прохода)
		table.insert(connections, {from = 13, to = 0, size = 0}) -- игрок1 т0
		table.insert(connections, {from = 13, to = 10, size = 0}) -- игрок1 тренер
		table.insert(connections, {from = 14, to = 8, size = 0}) -- игрок2 т0
		table.insert(connections, {from = 14, to = 9, size = 0}) -- игрок2 тренер

--		local zones = {
--			{1, 7},
--			{2, 6},
--			{3, 5},
--		}
	
--		local p = math.random(1,3)
--		table.insert(connections, {from = 13, to = zones[p][1], size = 0 })
--		table.insert(connections, {from = 14, to = zones[p][2], size = 0 })

	end
	return connections
end

-- Вернет описание содержимого сценария для генератора - ОК
function getTemplateContents(races, scenarioSize, parameters)
	local contents = {}
		
	if parameters then
		-- Режим
		if parameters[1] then
			gmode = parameters[1]
			if parameters[1] == 1 then
				contents.startingGold = 700
				contents.startingNativeMana = 200
				contents.roads = 35
				contents.forest = 30
			elseif parameters[1] == 2 then
				contents.startingGold = 1100
				contents.startingNativeMana = 400
				contents.roads = 30
				contents.forest = 30
			end
		end		
		-- Модификация
		if parameters[2] then
			if parameters[2] == 2 then
				kotovasia = 1
			elseif parameters[2] == 3 then
				playmobs = 1
			elseif parameters[2] == 4 then
				accuracy10 = 1
			end
		end
		-- Сила Нейтралы
		if parameters[3] then
			kef = parameters[3] / 100 * 0.92 -- 0.92 - старое расчётное значение
		end		
	end

	contents.customSubraces = customSubraces()
	contents.scenarioVariables = getScenarioVariables()
	contents.zones = getZones(races)
	contents.connections = getZoneConnections(races)

	return contents
end

-- ШАБЛОН
template = {
	name = smm(
			gmm('Outrunner-vintage '..ver, 'Outcross_vintage '..ver),
			gmm('Outrunner-judge-barton '..ver, 'Outcross-judge-barton '..ver),
			gmm('Outrunner '..ver, 'Outcross '..ver)
	),
	description = gmm('Модификации: «Котовасия» - наем воинов всех рас (автор Criogen92); «Playmobs» - управление мобами в бою; «Точность +10%» - бонус игрокам.\nDiscord-сервер с шаблонами и картами: discord.gg/zBJZpwfbdW\nАвтор шаблона: Uchenik. Поддержите на карту Т-Банк: 2200700846776804\nХорошей игры!', 'Схема: черная зона в центре, ее должны касаться все, кроме темно-серых.\nМодификации: «Котовасия» - наем воинов всех рас (автор Criogen92); «Playmobs» - управление мобами в бою; «Точность +10%» - бонус игрокам.\nDiscord-сервер с шаблонами и картами: discord.gg/zBJZpwfbdW\nАвтор шаблона: Uchenik. Поддержите на карту Т-Банк: 2200700846776804\nХорошей игры!'),
	minSize = 72,
	maxSize = 72,
	maxPlayers = smm(2, 3, 2),
	startingGold = gmm(700,1100),
	startingNativeMana = gmm(200,400),
	roads = gmm(35,30), --45,41
	forest = gmm(30,30), --42,40
	iterations = 10000, --5000

-- Параметры
	customParameters = {
		{
			name = 'Режим', -- parameters[1]
			values = { 'Один герой', 'Многогеройка' },
			default = 1,
		},
		{
			name = 'Модификация',  -- parameters[2]
			values = { 'Нет', 'Котовасия', 'Playmobs', 'Точность +10%' },
			default = 1,
		},
		{
			name = 'Сила Нейтралы', -- parameters[3] -- kef
			unit = '%',
			min = 50,
			max = 200,
			step = 5,
			default = 100,
		}
	},


-- Исключения юнитов
forbiddenUnits = {

-- Старндарные

-- Фракционные герои-лидеры и их вторые формы
'g000uu0021', --Архимаг
'g000uu8248', --Архимаг
'g000uu0020', --Следопыт
'g000uu0019', --Рыцарь на Пегасе
'g000uu0022', --Архангел
'g000uu0023', --Вор
'g000uu5300', --Вор
'g000uu0044', --Королевский страж
'g000uu0045', --Инженер
'g000uu0046', --Ученый
'g000uu8249', --Ученый
'g000uu0047', --Старейшина
'g000uu0048', --Вор
'g000uu5301', --Вор
'g000uu0070', --Герцог
'g000uu0071', --Советник
'g000uu0072', --Архидьявол
'g000uu8250', --Архидьявол
'g000uu0073', --Баронесса
'g000uu0074', --Вор
'g000uu5302', --Вор
'g000uu0096', --Рыцарь Смерти
'g000uu0097', --Носферату
'g000uu8252', --Носферату
'g000uu0098', --Королева личей
'g000uu8253', --Королева личей
'g000uu0099', --Баньши
'g000uu0100', --Вор
'g000uu5303', --Вор
'g000uu8251', --Дриада
'g000uu8010', --Дриада
'g000uu8009', --Вассал леса
'g000uu8011', --Страж леса
'g000uu8012', --Мудрец
'g000uu8013', --Вор
'g000uu5304', --Вор

-- Фракционные герои-солдаты
'g001uu0021', --Архимаг
'g001uu0020', --Следопыт
'g001uu0019', --Рыцарь на Пегасе
'g001uu0022', --Архангел
'g001uu0023', --Вор
'g001uu0045', --Инженер
'g001uu0044', --Королевский страж
'g001uu0046', --Ученый
'g070uu0003', --Ученый
'g001uu0047', --Старейшина
'g001uu0048', --Вор
'g001uu0072', --Архидьявол
'g070uu0004', --Архидьявол
'g001uu0071', --Советник
'g001uu0070', --Герцог
'g001uu0073', --Баронесса
'g001uu0074', --Вор
'g001uu0098', --Королева личей
'g070uu0001', --Носферату
'g001uu0097', --Носферату
'g001uu0096', --Рыцарь Смерти
'g001uu0099', --Баньши
'g001uu0100', --Вор
'g001uu8010', --Дриада
'g070uu0002', --Дриада
'g001uu8009', --Вассал леса
'g001uu8011', --Страж леса
'g001uu8012', --Мудрец
'g001uu8013', --Вор

-- Фракционные призыватели-солдаты с большим кол-вом опыта
'g001uu8238', -- Демиург
'g000uu8185', -- Магистр стихий
'g001uu7598', -- Теневидец
'g001uu8242', -- Xозяин масок
'g000uu0164', -- Повелитель волков

-- Фракционные хиллеры-солдаты с большим кол-вом опыта
'g000uu0017', -- Аббатиса
'g000uu8035', -- Вильсида
'g000uu7570', -- Епископ
'g000uu7569', -- Иерей
'g000uu8264', -- Иерарх
'g000uu0151', -- Прорицательница
'g000uu0013', -- Священник
'g000uu8214', -- Дриолисса
'g000uu8034', -- Солнечная Танцовщица
'g000uu0150', -- Патриарх
'g003uu8039', -- Древо жизни
'g003uu8038', -- Энт целитель
'g000uu8235', -- Сильфида
'g000uu2002', -- Целитель
'g003uu8037', -- Священное древо

-- нейтральные лидеры с низкой неподкупностью 20%
'g000uu5236', -- Гном
'g000uu5117', -- Гоблин
'g000uu5101', -- Крестьянин
'g000uu8308', -- Молодой триббог
'g000uu5130', -- Разбойник
'g000uu7556', -- Гоблин-жгун
'g000uu7533', -- Псина
'g000uu7510', -- Птица рух лидер
'g000uu7616', -- Гном упырь лидер
'g000uu6004', -- Толстый бес л.
'g000uu5201', -- Сквайр л.
'g000uu7539', -- Колотун
'g000uu7592', -- Торхот
'g000uu7516', -- Энт Малый л.
'g000uu5262', -- Сектант л.
'g000uu7614', -- Искатель рун лидер

--Все нейтральные хиллеры с большим кол-вом опыта (лидеры и солдаты)
'g000uu8287', -- Св.дерево л.
'g000uu8288', -- Энт целитель л.
'g000uu8215', -- Дриолисса л.
'g000uu8262', -- Знахарка л.
'g000uu8289', -- Древо жизни л
'g000uu7521', -- Целитель л.
'g000uu5006', -- Великий Оракул
'g000uu7544', -- Настоятельница
'g000uu8213', -- Гоблин-шаман
'g001uu8262', -- Знахарка
'g000uu2021', -- Проповедник
'g000uu6107', -- Темный эльф-жрец
'g000uu7619', -- Слуга культа

------------- Исключения юнитов Аутран
'g000uu8266', -- Дроттар--
'g000uu8265', -- дева пламени--
'g000uu8144', -- темный эльф гаст л.
'g000uu8044', -- темный эльф гаст
'g000uu2007', -- Мумификатор
'g000uu2008', -- Длань Мортис
--+
'g000uu7528', -- Мумификатор л.
'g000uu8318', -- Длань Мортис л.
'g000uu6113', -- Оккультист
'g000uu2022', -- Ламия
'g000uu8263', -- Чернокнижница
'g000uu8046', -- Шаманка

------------- Исключения водных лидеров
'g000uu8230', -- Чудище
'g000uu5127', -- Кракен
'g000uu5129', -- Морской змей
'g000uu7522', -- Наяда
'g000uu8138', -- Никса
'g000uu5126', -- Русалка
'g000uu7536', -- Элементаль Воды

},


forbiddenItems = {


-----------СТАНДАРТНЫЕ
-- ОСНОВНЫЕ
'g000ig6008', --Посох невидимости
'g000ig6017', --Посох дневного света
'g000ig6018', --Посох сумерек
'g000ig5092', --Свиток "terra illudere"
'g000ig0019', --Эликсир молниеносности
'g000ig0020', --Эликсир могущества
'g000ig0017', --Эликсир неуязвимости
'g001ig0129', --Зелье вампиризма50
'g001ig0020', --Великая аура вампиризма
'g001ig0035', --Великая аура жизненной силы
'g000ig5051', --Свиток "sanctuera"
'g000ig9006', --Сфера окаменения
'g000ig9039', --Сфера паралича
'g001ig0596', --Линарет

-- ПРЕДМЕТЫ НА УСКОР/РЕЗ МУВОВ
'g000ig5032', --Свиток "Песнь скорости"
'g000ig5053', --Свиток "Paraseus"
'g000ig5094', --Свиток "Псалом Смерти"
'g000ig6004', --Посох парализации
'g000ig6005', --Посох путника
'g001ig0390', --Посох терна
'g001ig0389', --Посох первооткрывателя
'g001ig0513', --Зелье твердого шага

------------------ АУТРАН
'g001ig0414', --Отравленный вороний коготь (Артефакт)--
'g000ig3015', --кристалл души (артефакт)--
'g000ig3016', --рог инкуба (артефакт)--
'g001ig0158', --ужасающий топор (артефакт)--
'g000ig3021', --кольцо колдуньи (артефакт)--
'g001ig0155', --Благословенный браслет (Артефакт)

'g000ig9040', --Сфера Полиморфа
'g000ig9043', --Сфера ярости
'g000ig9007', --Сфера понижения уровня
'g001ig0181', --Сфера Страха
'g000ig9020', --Сфера Энергии
'g000ig9023', --Сфера Инферно 900
'g001ig0131', --Сфера Урона III 700


'g000ig2007', --ржавые кандалы--
'g000ig1011', --сапоги мореплавания
'g001ig0044', --Сердце океана (Артефакт)

'g001ig0154', -- знамя поглощения--50%

'g000ig5027', --свиток мореплавания
'g000ig5006', --Свиток "Ускорение"--
'g000ig5100', --Свиток "Скорость"--
'g000ig5113', --Свиток "Порыв"--
'g000ig5099', --Свиток "Опутывание"--
'g001ig0094', --Свиток "Поспешность" отступление
'g000ig5120', --Свиток "Проворство" отступление

-- ещё
'g001ig0575', --Свиток "Подавляющая жизнь
'g001ig0572', --Свиток "Неотвратимая месть"
'g000ig9140', --Талисман лесной колдуньи 800
'g001ig0006', --Эликсир маскировки

--посох
'g001ig0386', -- Посох семи ветров
'g000ig6019', -- Посох Листвы 400 (обидно ну)

--предметы на опыт
'g001ig0516', -- Зелье омоложения разума (-10 опыт)
'g001ig0518', -- Зелье проницательности (-15 опыт) 
'g001ig0523', -- Зелье воеводы (+10 отряду)

--зелья на перки генерятся с другими пермобанками
'g001ig0531', -- Зелье слова (свитки) 500
'g001ig0524', -- Зелье завоевателя (жезлы) 500
'g001ig0526', -- Зелье оруженосца (знамёна) 600
'g001ig0530', -- Зелье посмертного зова (талики)
'g001ig0527', -- Зелье постижения (релики)
'g001ig0529', -- Каталог магических сфер
'g001ig0528', -- Честный труд (сапоги)
'g001ig0525', -- Эликсир учености (арты)
'g001ig0501', -- Дары Галлеана (хождение по лесу) 750

--зелья
'g001ig0317', -- Зелье дьявольских таинств  (+15% пермо вампирик) 600

--свитки
'g001ig0195', --Свиток "Откровение" (для аутрана не катит)
'g001ig0439', --Свиток "Et seminibus discordiae - Уменьшает лидерство на 1 в области 5x5 (не для аутранера)
'g001ig0440', --Свиток "Проклятие безволия минус лидерство
'g001ig0092', --Свиток "Гниение леса" за 400 в ролле нафиг надо
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа за 700 в ролле нафиг надо
'g000ig5118', --Свиток "Ослепления" Уменьшает обзор противника на 3 в радиусе 5х5.
'g000ig5057', --Свиток "Мerum Facies" Защита от полиморфа.
'g000ig5059', --Свиток "Incantare Avenger Illudere" (Фантом Адского Мстителя)
'g001ig0078', --Свиток "Призыв IV: Стихийный голем"


},

	getContents = getTemplateContents
}